{"pageProps":{"data":{"count":1,"rows":[{"id":80,"title":"Undefined, unspecified and implementation-defined behavior","slug":"undefined-unspecified-and-implementation-defined-behavior-1657384516085","postType":"QUESTION","createdAt":"2022-07-09T16:35:16.000Z","updatedAt":"2022-07-09T16:35:16.000Z","tags":[{"id":295,"name":"unspecified-behavior","slug":"unspecified-behavior","createdAt":"2022-07-09T16:35:16.000Z","updatedAt":"2022-07-09T16:35:16.000Z","Questions_Tags":{"questionId":80,"tagId":295}}]}]},"slug":"unspecified-behavior","page":"1","answers":{"80":["\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Undefined behavior&lt;/strong&gt;&lt;/em&gt; is one of those aspects of the C and C++ language that can be surprising to programmers coming from other languages (other languages try to hide it better). Basically,  it is possible to write C++ programs that do not behave in a predictable way, even though many C++ compilers will not report any errors in the program!&lt;/p&gt;\n&lt;p&gt;Let&apos;s look at a classic example:&lt;/p&gt;\n&lt;pre class=&quot;default s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-meta&quot;&gt;#&lt;span class=&quot;hljs-keyword&quot;&gt;include&lt;/span&gt; &lt;span class=&quot;hljs-string&quot;&gt;&amp;lt;iostream&amp;gt;&lt;/span&gt;&lt;/span&gt;\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;main&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;\n&lt;/span&gt;{\n    &lt;span class=&quot;hljs-type&quot;&gt;char&lt;/span&gt;* p = &lt;span class=&quot;hljs-string&quot;&gt;&quot;hello!\\n&quot;&lt;/span&gt;;   &lt;span class=&quot;hljs-comment&quot;&gt;// yes I know, deprecated conversion&lt;/span&gt;\n    p[&lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;] = &lt;span class=&quot;hljs-string&quot;&gt;&apos;y&apos;&lt;/span&gt;;\n    p[&lt;span class=&quot;hljs-number&quot;&gt;5&lt;/span&gt;] = &lt;span class=&quot;hljs-string&quot;&gt;&apos;w&apos;&lt;/span&gt;;\n    std::cout &amp;lt;&amp;lt; p;\n}\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;The variable &lt;code&gt;p&lt;/code&gt; points to the string literal &lt;code&gt;&quot;hello!\\n&quot;&lt;/code&gt;, and the two assignments below try to modify that string literal. What does this program do? According to section 2.14.5 paragraph 11 of the C++ standard, it invokes &lt;em&gt;undefined behavior&lt;/em&gt;:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;The effect of attempting to modify a string literal is undefined.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;I can hear people screaming &quot;But wait, I can compile this no problem and get the output &lt;code&gt;yellow&lt;/code&gt;&quot; or &quot;What do you mean undefined, string literals are stored in read-only memory, so the first assignment attempt results in a core dump&quot;. This is exactly the problem with undefined behavior. Basically, the standard allows anything to happen once you invoke undefined behavior (even nasal demons). If there is a &quot;correct&quot; behavior according to your mental model of the language, that model is simply wrong; The C++ standard has the only vote, period.&lt;/p&gt;\n&lt;p&gt;Other examples of undefined behavior include accessing an array beyond its bounds, &lt;a href=&quot;https://stackoverflow.com/q/2894891&quot;&gt;dereferencing the null pointer&lt;/a&gt;, &lt;a href=&quot;https://stackoverflow.com/q/6441218&quot;&gt;accessing objects after their lifetime ended&lt;/a&gt; or writing &lt;a href=&quot;https://stackoverflow.com/q/949433&quot;&gt;allegedly clever expressions&lt;/a&gt; like &lt;code&gt;i++ + ++i&lt;/code&gt;.&lt;/p&gt;\n&lt;p&gt;Section 1.9 of the C++ standard also mentions undefined behavior&apos;s two less dangerous brothers, &lt;strong&gt;unspecified behavior&lt;/strong&gt; and &lt;strong&gt;implementation-defined behavior&lt;/strong&gt;:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;The semantic descriptions in this International Standard define a parameterized nondeterministic abstract machine.&lt;/p&gt;\n&lt;p&gt;Certain aspects and operations of the abstract machine are described in this International Standard as &lt;strong&gt;implementation-defined&lt;/strong&gt; (for example, &lt;code&gt;sizeof(int)&lt;/code&gt;). These constitute the parameters of the abstract machine. Each implementation shall include documentation describing its characteristics and behavior in these respects.&lt;/p&gt;\n&lt;p&gt;Certain other aspects and operations of the abstract machine are described in this International Standard as &lt;strong&gt;unspecified&lt;/strong&gt; (for example, order of evaluation of arguments to a function). Where possible, this International Standard defines a set of allowable behaviors. These define the nondeterministic aspects of the abstract machine.&lt;/p&gt;\n&lt;p&gt;Certain other operations are described in this International Standard as &lt;strong&gt;undefined&lt;/strong&gt; (for example, the  effect of dereferencing the null pointer). [ &lt;em&gt;Note&lt;/em&gt;: &lt;strong&gt;this International Standard imposes no requirements on the behavior of programs that contain undefined behavior.&lt;/strong&gt; &lt;em&gt;end note&lt;/em&gt; ]&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;Specifically, section 1.3.24 states:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Permissible undefined behavior ranges from &lt;strong&gt;ignoring the situation completely with unpredictable results&lt;/strong&gt;, to behaving during translation or program execution in a documented manner characteristic of the environment (with or without the issuance of a diagnostic message), to terminating a translation or execution (with the issuance of a diagnostic message).&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;What can you do to avoid running into undefined behavior? Basically, you have to read &lt;a href=&quot;https://stackoverflow.com/questions/388242/&quot;&gt;good C++ books&lt;/a&gt; by authors who know what they&apos;re talking about. Avoid internet tutorials. Avoid bullschildt.&lt;/p&gt;\n    ","\n&lt;p&gt;Well, this is basically a straight copy-paste from the standard&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;3.4.1&lt;/strong&gt; 1 &lt;strong&gt;implementation-defined behavior&lt;/strong&gt; unspecified behavior where\neach implementation documents how the\nchoice is made&lt;/p&gt;\n&lt;p&gt;2 EXAMPLE An example of\nimplementation-defined behavior is the\npropagation of the high-order bit when\na signed integer is shifted right.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;3.4.3&lt;/strong&gt; 1 &lt;strong&gt;undefined behavior&lt;/strong&gt; behavior, upon use of a nonportable or erroneous\nprogram construct or of erroneous\ndata, for which this International\nStandard imposes no requirements&lt;/p&gt;\n&lt;p&gt;2\nNOTE Possible undefined behavior\nranges from ignoring the situation\ncompletely with unpredictable results,\nto behaving during translation or\nprogram execution in a documented\nmanner characteristic of the\nenvironment (with or without the\nissuance of a diagnostic message), to\nterminating a translation or execution\n(with the issuance of a diagnostic\nmessage).&lt;/p&gt;\n&lt;p&gt;3 EXAMPLE An example of\nundefined behavior is the behavior on\ninteger overflow.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;3.4.4&lt;/strong&gt; 1 &lt;strong&gt;unspecified behavior&lt;/strong&gt; use of an unspecified value, or other behavior\nwhere this International Standard\nprovides two or more possibilities and\nimposes no further requirements on\nwhich is chosen in any instance&lt;/p&gt;\n&lt;p&gt;2\nEXAMPLE An example of unspecified\nbehavior is the order in which the\narguments to a function are evaluated.&lt;/p&gt;\n&lt;/blockquote&gt;\n    ","\n&lt;p&gt;Maybe easy wording could be easier for understanding than the rigorous definition of the standards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;implementation-defined behavior&lt;/strong&gt;&lt;br&gt;\nThe language says that we have data-types. The compiler vendors specify what sizes shall they use, and provide a documentation of what they did.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;undefined behavior&lt;/strong&gt;&lt;br&gt;\nYou are doing something wrong. For example, you have a very large value in an &lt;code&gt;int&lt;/code&gt; that doesn&apos;t fit in &lt;code&gt;char&lt;/code&gt;. How do you put that value in &lt;code&gt;char&lt;/code&gt;? actually there is no way! Anything could happen, but the most sensible thing would be to take the first byte of that int and put it in &lt;code&gt;char&lt;/code&gt;. It is just wrong to do that to assign the first byte, but thats what happens under the hood.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;unspecified behavior&lt;/strong&gt;&lt;br&gt;\nWhich function of these two is executed first?&lt;/p&gt;\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;fun&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; n, &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; m)&lt;/span&gt;&lt;/span&gt;;\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;fun1&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; &lt;/span&gt;{\n    std::cout &amp;lt;&amp;lt; &lt;span class=&quot;hljs-string&quot;&gt;&quot;fun1&quot;&lt;/span&gt;;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;;\n}\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;fun2&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; &lt;/span&gt;{\n    std::cout &amp;lt;&amp;lt; &lt;span class=&quot;hljs-string&quot;&gt;&quot;fun2&quot;&lt;/span&gt;;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;;\n}\n...\n&lt;span class=&quot;hljs-built_in&quot;&gt;fun&lt;/span&gt;(&lt;span class=&quot;hljs-built_in&quot;&gt;fun1&lt;/span&gt;(), &lt;span class=&quot;hljs-built_in&quot;&gt;fun2&lt;/span&gt;()); &lt;span class=&quot;hljs-comment&quot;&gt;// which one is executed first?&lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;The language doesn&apos;t specify the evaluation, left to right or right to left! So an unspecified behavior may or mayn&apos;t result in an undefined behavior, but certainly your program should not produce an unspecified behavior.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;@eSKay I think your question is worth editing the answer to clarify more :)&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;for &lt;code&gt;fun(fun1(), fun2());&lt;/code&gt; isn&apos;t the behaviour &quot;implementation defined&quot;? The compiler has to choose one or the other course, after all?&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;The difference between implementation-defined and unspecified, is that the compiler is supposed to pick a behavior in the first case but it doesn&apos;t have to in the second case. For example, an implementation must have one and only one definition of &lt;code&gt;sizeof(int)&lt;/code&gt;. So, it can&apos;t say that &lt;code&gt;sizeof(int)&lt;/code&gt; is 4 for some portion of the program and 8 for others. Unlike unspecified behavior, where the compiler can say OK I am gonna evaluate these arguments left-to-right and the next function&apos;s arguments are evaluated right-to-left. It can happen in the same program, that&apos;s why it is called &lt;em&gt;&lt;strong&gt;unspecified&lt;/strong&gt;&lt;/em&gt;. In fact, C++ could have been made easier if some of the unspecified behaviors were specified. Take a look here at &lt;a href=&quot;//www.stroustrup.com/bs_faq2.html#undefined&quot; rel=&quot;nofollow noreferrer&quot;&gt;Dr. Stroustrup&apos;s answer for that&lt;/a&gt;:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;It is claimed that the difference between what can be produced giving the compiler this freedom and requiring &quot;ordinary left-to-right evaluation&quot; can be significant. I&apos;m unconvinced, but with innumerable compilers &quot;out there&quot; taking advantage of the freedom and some people passionately defending that freedom, a change would be difficult and could take decades to penetrate to the distant corners of the C and C++ worlds. I am disappointed that not all compilers warn against code such as &lt;code&gt;++i+i++&lt;/code&gt;. Similarly, the order of evaluation of arguments is unspecified.&lt;/p&gt;\n&lt;p&gt;IMO far too many &quot;things&quot; are left undefined, unspecified, that&apos;s easy to say and even to give examples of, but hard to fix. It should also be noted that it is not all that difficult to avoid most of the problems and produce portable code.&lt;/p&gt;\n&lt;/blockquote&gt;\n    ","\n&lt;p&gt;From the official C Rationale Document&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;The terms &lt;em&gt;unspecified&lt;/em&gt; behavior, &lt;em&gt;undefined&lt;/em&gt; behavior, and &lt;em&gt;implementation-defined&lt;/em&gt; behavior are used to categorize the result of writing programs whose properties the Standard does not, or cannot, completely describe.  The goal of adopting this categorization is to allow a certain variety among implementations which permits quality of implementation to be an active force in the marketplace as well as to allow certain popular extensions, without removing the cachet of conformance to the Standard.  Appendix F to the Standard catalogs those behaviors which fall into one of these three categories. &lt;/p&gt;\n  \n  &lt;p&gt;&lt;em&gt;Unspecified behavior&lt;/em&gt; gives the implementor some latitude in translating programs.  This latitude does not extend as far as failing to translate the program. &lt;/p&gt;\n  \n  &lt;p&gt;&lt;em&gt;Undefined behavior&lt;/em&gt; gives the implementor license not to catch certain program errors that are difficult to diagnose.  It also identifies areas of possible conforming language extension: the implementor may augment the language by providing a definition of the officially undefined behavior. &lt;/p&gt;\n  \n  &lt;p&gt;&lt;em&gt;Implementation-defined&lt;/em&gt; behavior gives an implementor the freedom to choose the appropriate approach, but requires that this choice be explained to the user.  Behaviors designated as implementation-defined are generally those in which a user could make meaningful coding decisions based on the implementation definition.  Implementors should bear in mind this criterion when deciding how extensive an implementation definition ought to be.  As with unspecified behavior, simply failing to translate the source containing the implementation-defined behavior is not an adequate response. &lt;/p&gt;\n&lt;/blockquote&gt;\n    ","\n&lt;p&gt;&lt;a href=&quot;http://www.devx.com/tips/Tip/12684&quot; rel=&quot;noreferrer&quot;&gt;Undefined Behavior vs. Unspecified Behavior&lt;/a&gt; has a short description of it.&lt;/p&gt;\n\n&lt;p&gt;Their final summary:&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;To sum up, unspecified behavior is usually something you shouldn&apos;t\n  worry about, unless your software is required to be portable.\n  Conversely, undefined behavior is always undesirable and should never\n  occur.&lt;/p&gt;\n&lt;/blockquote&gt;\n    ","\n&lt;p&gt;Implementation defined- &lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;Implementors wish,should be well documented,standard gives choices but sure to compile&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Unspecified -&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;Same as implementation-defined but not documented&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Undefined-&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;Anything might happen,take care of it.&lt;/p&gt;\n&lt;/blockquote&gt;\n    ","\n&lt;p&gt;Historically, both Implementation-Defined Behavior and Undefined Behavior represented situations in which the authors of the Standard expected that people writing quality implementations would use judgment to decide what behavioral guarantees, if any, would be useful for programs in the intended application field running on the intended targets.  The needs of high-end number-crunching code are quite different from those of low-level systems code, and both UB and IDB give compiler writers flexibility to meet those different needs.  Neither category mandates that implementations behave in a way that&apos;s useful for any particular purpose, or even for any purpose whatsoever.  Quality implementations that claim to be suitable for a particular purpose, however, should behave in a manner befitting such purpose &lt;em&gt;whether the Standard requires it or not&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;The only difference between Implementation-Defined Behavior and Undefined Behavior is that the former requires that implementations define and document a consistent behavior &lt;em&gt;even in cases where nothing the implementation could possibly do would be useful&lt;/em&gt;.  The dividing line between them is not whether it would generally be useful for implementations to define behaviors (compiler writers should define useful behaviors when practical whether the Standard requires them to or not) but &lt;em&gt;whether there might be implementations where defining a behavior would be simultaneously costly and useless&lt;/em&gt;.  A judgment that such implementations might exist does not in any way, shape, or form, imply any judgment about the usefulness of supporting a defined behavior on other platforms.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, since the mid 1990s compiler writers have started to interpret the lack of behavioral mandates as an judgment that behavioral guarantees aren&apos;t worth the cost even in application fields where they&apos;re vital, and even on systems where they cost practically nothing.  Instead of treating UB as an invitation to exercise reasonable judgment, compiler writers have started treating it as an excuse &lt;em&gt;not&lt;/em&gt; to do so.&lt;/p&gt;\n\n&lt;p&gt;For example, given the following code:&lt;/p&gt;\n\n&lt;pre class=&quot;default s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;scaled_velocity&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; v, &lt;span class=&quot;hljs-type&quot;&gt;unsigned&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;char&lt;/span&gt; pow)&lt;/span&gt;\n&lt;/span&gt;{\n  &lt;span class=&quot;hljs-keyword&quot;&gt;if&lt;/span&gt; (v &amp;gt; &lt;span class=&quot;hljs-number&quot;&gt;250&lt;/span&gt;)\n    v = &lt;span class=&quot;hljs-number&quot;&gt;250&lt;/span&gt;;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;if&lt;/span&gt; (v &amp;lt; &lt;span class=&quot;hljs-number&quot;&gt;-250&lt;/span&gt;)\n    v = &lt;span class=&quot;hljs-number&quot;&gt;-250&lt;/span&gt;;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; v &amp;lt;&amp;lt; pow;\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;a two&apos;s-complement implementation would not have to expend any effort\nwhatsoever to treat the expression &lt;code&gt;v &amp;lt;&amp;lt; pow&lt;/code&gt; as a two&apos;s-complement shift\nwithout regard for whether &lt;code&gt;v&lt;/code&gt; was positive or negative.&lt;/p&gt;\n\n&lt;p&gt;The preferred philosophy among some of today&apos;s compiler writers, however, would suggest that because &lt;code&gt;v&lt;/code&gt; can only be negative if the program is going to engage in Undefined Behavior, there&apos;s no reason to have the program clip the negative range of &lt;code&gt;v&lt;/code&gt;.  Even though left-shifting of negative values used to be supported on every single compiler of significance, and a large amount of existing code relies upon that behavior, modern philosophy would interpret the fact that the Standard says that left-shifting negative values is UB as implying that compiler writers should feel free to ignore that.&lt;/p&gt;\n    ","\n&lt;p&gt;C++ standard n3337  &lt;strong&gt;ยง&lt;/strong&gt; 1.3.10\n&lt;strong&gt;implementation-defined behavior&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;behavior, for a well-formed program construct and correct data, that\n  depends on the implementation and that each implementation documents&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sometimes C++ Standard doesn&apos;t impose particular behavior on some constructs but says instead that a particular, well defined behavior has to be chosen and &lt;strong&gt;described&lt;/strong&gt; by particular implementation (version of library). So user can still know exactly how will program behave even though Standard doesn&apos;t describe this. &lt;/p&gt;\n\n&lt;hr&gt;\n\n&lt;p&gt;C++ standard n3337  &lt;strong&gt;ยง&lt;/strong&gt; 1.3.24\n&lt;strong&gt;undefined behavior&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;behavior for which this International Standard imposes no requirements\n  [ Note: Undefined behavior may be expected when this International\n  Standard omits any explicit definition of behavior or when a program\n  uses an erroneous construct or erroneous data. Permissible undefined\n  behavior ranges from ignoring the situation completely with\n  unpredictable results, to behaving during translation or program\n  execution in a documented manner characteristic of the environment\n  (with or without the issuance of a diagnostic message), to terminating\n  a translation or execution (with the issuance of a diagnostic\n  message). Many erroneous program constructs do not engender undefined\n  behavior; they are required to be diagnosed.  end note ]&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When the program encounters construct that is not defined according to C++ Standard it is allowed to do whatever it wants to do ( maybe send an email to me or maybe send an email to you or maybe ignore the code completely). &lt;/p&gt;\n\n&lt;hr&gt;\n\n&lt;p&gt;C++ standard n3337  &lt;strong&gt;ยง&lt;/strong&gt; 1.3.25\n&lt;strong&gt;unspecified behavior&lt;/strong&gt;&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;behavior, for a well-formed program construct and correct data, that\n  depends on the implementation [ Note: The implementation is not\n  required to document which behavior occurs. The range of possible\n  behaviors is usually delineated by this International Standard.  end\n  note ]&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;C++ Standard doesn&apos;t impose particular behavior on some constructs but says instead that a particular, well defined behavior has to be chosen ( &lt;strong&gt;bot not necessary described&lt;/strong&gt;) by particular implementation (version of library). So in the case when no description has been provided it can be difficult to the user to know exactly how will program behave.&lt;/p&gt;\n    ","\n&lt;p&gt;Undefined behavior is &lt;em&gt;ugly&lt;/em&gt; -- as in, &quot;The good, the bad, and the ugly&quot;.&lt;/p&gt;\n&lt;p&gt;Good: a program that compiles and works, for the right reasons.&lt;/p&gt;\n&lt;p&gt;Bad: a program that has an error, of a kind that the compiler can detect and complain about.&lt;/p&gt;\n&lt;p&gt;Ugly: a program that has an error, that the compiler &lt;em&gt;cannot&lt;/em&gt; detect and warn about, meaning that the program compiles, and may seem to work correctly some of the time, but also fails bizarrely some of the time.  That&apos;s what undefined behavior is.&lt;/p&gt;\n&lt;p&gt;Some program languages and other formal systems try hard to limit the &quot;gulf of undefinedness&quot; -- that is, they try to arrange things so that most or all programs are either &quot;good&quot; or &quot;bad&quot;, and that very few are &quot;ugly&quot;.  It&apos;s a characteristic feature of C, however, that its &quot;gulf of undefinedness&quot; is quite wide.&lt;/p&gt;\n    "]},"randomTags":[{"name":"pivot","slug":"pivot"},{"name":"reference","slug":"reference"},{"name":"model","slug":"model"},{"name":"asp.net-mvc-4","slug":"asp.net-mvc-4"},{"name":"ssl","slug":"ssl"},{"name":"http-status-code-404","slug":"http-status-code-404"},{"name":"android-permissions","slug":"android-permissions"},{"name":"branch-prediction","slug":"branch-prediction"},{"name":"algorithm","slug":"algorithm"},{"name":"android-resources","slug":"android-resources"},{"name":"precision","slug":"precision"},{"name":"gets","slug":"gets"},{"name":"dataframe","slug":"dataframe"},{"name":"pygame","slug":"pygame"},{"name":"bitwise-operators","slug":"bitwise-operators"},{"name":"python-packaging","slug":"python-packaging"},{"name":"three.js","slug":"three.js"},{"name":"blob","slug":"blob"},{"name":"variable-length","slug":"variable-length"},{"name":"preg-replace","slug":"preg-replace"}]},"__N_SSG":true}