{"pageProps":{"data":{"count":1,"rows":[{"id":63,"title":"Can a local variable's memory be accessed outside its scope?","slug":"can-a-local-variable's-memory-be-accessed-outside-its-scope-1657384460386","postType":"QUESTION","createdAt":"2022-07-09T16:34:20.000Z","updatedAt":"2022-07-09T16:34:20.000Z","tags":[{"id":229,"name":"memory-management","slug":"memory-management","createdAt":"2022-07-09T16:34:20.000Z","updatedAt":"2022-07-09T16:34:20.000Z","Questions_Tags":{"questionId":63,"tagId":229}}]}]},"slug":"memory-management","page":"1","answers":{"63":["\n&lt;blockquote&gt;\n  &lt;p&gt;How can it be? Isn&apos;t the memory of a local variable inaccessible outside its function?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You rent a hotel room. You put a book in the top drawer of the bedside table and go to sleep.  You check out the next morning, but &quot;forget&quot; to give back your key. You steal the key!&lt;/p&gt;\n\n&lt;p&gt;A week later, you return to the hotel, do not check in, sneak into your old room with your stolen key, and look in the drawer. Your book is still there. Astonishing!&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;How can that be? Aren&apos;t the contents of a hotel room drawer inaccessible if you haven&apos;t rented the room?&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Well, obviously that scenario can happen in the real world no problem. There is no mysterious force that causes your book to disappear when you are no longer authorized to be in the room. Nor is there a mysterious force that prevents you from entering a room with a stolen key.&lt;/p&gt;\n\n&lt;p&gt;The hotel management is not &lt;em&gt;required&lt;/em&gt; to remove your book. You didn&apos;t make a contract with them that said that if you leave stuff behind, they&apos;ll shred it for you. If you illegally re-enter your room with a stolen key to get it back, the hotel security staff is not &lt;em&gt;required&lt;/em&gt; to catch you sneaking in. You didn&apos;t make a contract with them that said &quot;if I try to sneak back into my room later, you are required to stop me.&quot; Rather, you signed a contract with them that said &quot;I promise not to sneak back into my room later&quot;, a contract which &lt;em&gt;you broke&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;In this situation &lt;strong&gt;anything can happen&lt;/strong&gt;. The book can be there -- you got lucky. Someone else&apos;s book can be there and yours could be in the hotel&apos;s furnace. Someone could be there right when you come in, tearing your book to pieces. The hotel could have removed the table and book entirely and replaced it with a wardrobe. The entire hotel could be just about to be torn down and replaced with a football stadium, and you are going to die in an explosion while you are sneaking around. &lt;/p&gt;\n\n&lt;p&gt;You don&apos;t know what is going to happen; when you checked out of the hotel and stole a key to illegally use later, you gave up the right to live in a predictable, safe world because &lt;em&gt;you&lt;/em&gt; chose to break the rules of the system.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;C++ is not a safe language&lt;/strong&gt;. It will cheerfully allow you to break the rules of the system. If you try to do something illegal and foolish like going back into a room you&apos;re not authorized to be in and rummaging through a desk that might not even be there anymore, C++ is not going to stop you. Safer languages than C++ solve this problem by restricting your power -- by having much stricter control over keys, for example.&lt;/p&gt;\n\n&lt;h2&gt;UPDATE&lt;/h2&gt;\n\n&lt;p&gt;Holy goodness, this answer is getting a lot of attention. (I&apos;m not sure why -- I considered it to be just a &quot;fun&quot; little analogy, but whatever.)&lt;/p&gt;\n\n&lt;p&gt;I thought it might be germane to update this a bit with a few more technical thoughts.&lt;/p&gt;\n\n&lt;p&gt;Compilers are in the business of generating code which manages the storage of the data manipulated by that program. There are lots of different ways of generating code to manage memory, but over time two basic techniques have become entrenched. &lt;/p&gt;\n\n&lt;p&gt;The first is to have some sort of &quot;long lived&quot; storage area where the &quot;lifetime&quot; of each byte in the storage -- that is, the period of time when it is validly associated with some program variable -- cannot be easily predicted ahead of time. The compiler generates calls into a &quot;heap manager&quot; that knows how to dynamically allocate storage when it is needed and reclaim it when it is no longer needed.&lt;/p&gt;\n\n&lt;p&gt;The second method is to have a short-lived storage area where the lifetime of each byte is well known. Here, the lifetimes follow a nesting pattern. The longest-lived of these short-lived variables will be allocated before any other short-lived variables, and will be freed last. Shorter-lived variables will be allocated after the longest-lived ones, and will be freed before them. The lifetime of these shorter-lived variables is nested within the lifetime of longer-lived ones.&lt;/p&gt;\n\n&lt;p&gt;Local variables follow the latter pattern; when a method is entered, its local variables come alive. When that method calls another method, the new method&apos;s local variables come alive. They&apos;ll be dead before the first method&apos;s local variables are dead.  The relative order of the beginnings and endings of lifetimes of storages associated with local variables can be worked out ahead of time.&lt;/p&gt;\n\n&lt;p&gt;For this reason, local variables are usually generated as storage on a &quot;stack&quot; data structure, because a stack has the property that the first thing pushed on it is going to be the last thing popped off. &lt;/p&gt;\n\n&lt;p&gt;It&apos;s like the hotel decides to only rent out rooms sequentially, and you can&apos;t check out until everyone with a room number higher than you has checked out. &lt;/p&gt;\n\n&lt;p&gt;So let&apos;s think about the stack. In many operating systems you get one stack per thread and the stack is allocated to be a certain fixed size. When you call a method, stuff is pushed onto the stack. If you then pass a pointer to the stack back out of your method, as the original poster does here, that&apos;s just a pointer to the middle of some entirely valid million-byte memory block. In our analogy, you check out of the hotel; when you do, you just checked out of the highest-numbered occupied room.  If no one else checks in after you, and you go back to your room illegally, all your stuff is guaranteed to still be there &lt;em&gt;in this particular hotel&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;We use stacks for temporary stores because they are really cheap and easy. An implementation of C++ is not required to use a stack for storage of locals; it could use the heap. It doesn&apos;t, because that would make the program slower. &lt;/p&gt;\n\n&lt;p&gt;An implementation of C++ is not required to leave the garbage you left on the stack untouched so that you can come back for it later illegally; it is perfectly legal for the compiler to generate code that turns back to zero everything in the &quot;room&quot; that you just vacated. It doesn&apos;t because again, that would be expensive.&lt;/p&gt;\n\n&lt;p&gt;An implementation of C++ is not required to ensure that when the stack logically shrinks, the addresses that used to be valid are still mapped into memory. The implementation is allowed to tell the operating system &quot;we&apos;re done using this page of stack now. Until I say otherwise, issue an exception that destroys the process if anyone touches the previously-valid stack page&quot;.  Again, implementations do not actually do that because it is slow and unnecessary.&lt;/p&gt;\n\n&lt;p&gt;Instead, implementations let you make mistakes and get away with it. Most of the time. Until one day something truly awful goes wrong and the process explodes.&lt;/p&gt;\n\n&lt;p&gt;This is problematic. There are a lot of rules and it is very easy to break them accidentally. I certainly have many times. And worse, the problem often only surfaces when memory is detected to be corrupt billions of nanoseconds after the corruption happened, when it is very hard to figure out who messed it up.&lt;/p&gt;\n\n&lt;p&gt;More memory-safe languages solve this problem by restricting your power. In &quot;normal&quot; C# there simply is no way to take the address of a local and return it or store it for later. You can take the address of a local, but the language is cleverly designed so that it is impossible to use it after the lifetime of the local ends. In order to take the address of a local and pass it back, you have to put the compiler in a special &quot;unsafe&quot; mode, &lt;em&gt;and&lt;/em&gt; put the word &quot;unsafe&quot; in your program, to call attention to the fact that you are probably doing something dangerous that could be breaking the rules. &lt;/p&gt;\n\n&lt;p&gt;For further reading:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;What if C# did allow returning references? Coincidentally that is the subject of today&apos;s blog post:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=&quot;https://ericlippert.com/2011/06/23/ref-returns-and-ref-locals/&quot; rel=&quot;noreferrer&quot;&gt;https://ericlippert.com/2011/06/23/ref-returns-and-ref-locals/&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why do we use stacks to manage memory? Are value types in C# always stored on the stack? How does virtual memory work? And many more topics in how the C# memory manager works. Many of these articles are also germane to C++ programmers:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=&quot;https://ericlippert.com/tag/memory-management/&quot; rel=&quot;noreferrer&quot;&gt;https://ericlippert.com/tag/memory-management/&lt;/a&gt;&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;What you&apos;re doing here is simply reading and writing to memory that &lt;i&gt;used to&lt;/i&gt; be the address of &lt;code&gt;a&lt;/code&gt;. Now that you&apos;re outside of &lt;code&gt;foo&lt;/code&gt;, it&apos;s just a pointer to some random memory area. It just so happens that in your example, that memory area does exist and nothing else is using it at the moment. You don&apos;t break anything by continuing to use it, and nothing else has overwritten it yet. Therefore, the &lt;code&gt;5&lt;/code&gt; is still there. In a real program, that memory would be re-used almost immediately and you&apos;d break something by doing this (though the symptoms may not appear until much later!)&lt;/p&gt;\n\n&lt;p&gt;When you return from &lt;code&gt;foo&lt;/code&gt;, you tell the OS that you&apos;re no longer using that memory and it can be reassigned to something else. If you&apos;re lucky and it never does get reassigned, and the OS doesn&apos;t catch you using it again, then you&apos;ll get away with the lie. Chances are though you&apos;ll end up writing over whatever else ends up with that address.&lt;/p&gt;\n\n&lt;p&gt;Now if you&apos;re wondering why the compiler doesn&apos;t complain, it&apos;s probably because &lt;code&gt;foo&lt;/code&gt; got eliminated by optimization. It usually will warn you about this sort of thing. C assumes you know what you&apos;re doing though, and technically you haven&apos;t violated scope here (there&apos;s no reference to &lt;code&gt;a&lt;/code&gt; itself outside of &lt;code&gt;foo&lt;/code&gt;), only memory access rules, which only triggers a warning rather than an error.&lt;/p&gt;\n\n&lt;p&gt;In short: this won&apos;t usually work, but sometimes will by chance.&lt;/p&gt;\n    ","\n&lt;p&gt;Because the storage space wasn&apos;t stomped on just yet. Don&apos;t count on that behavior.&lt;/p&gt;\n    ","\n&lt;p&gt;A little addition to all the answers:&lt;/p&gt;\n\n&lt;p&gt;if you do something like that:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-meta&quot;&gt;#&lt;span class=&quot;hljs-keyword&quot;&gt;include&lt;/span&gt;&lt;span class=&quot;hljs-string&quot;&gt;&amp;lt;stdio.h&amp;gt;&lt;/span&gt;&lt;/span&gt;\n&lt;span class=&quot;hljs-meta&quot;&gt;#&lt;span class=&quot;hljs-keyword&quot;&gt;include&lt;/span&gt; &lt;span class=&quot;hljs-string&quot;&gt;&amp;lt;stdlib.h&amp;gt;&lt;/span&gt;&lt;/span&gt;\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; * &lt;span class=&quot;hljs-title&quot;&gt;foo&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;&lt;/span&gt;{\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; a = &lt;span class=&quot;hljs-number&quot;&gt;5&lt;/span&gt;;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &amp;amp;a;\n}\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;boo&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;&lt;/span&gt;{\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; a = &lt;span class=&quot;hljs-number&quot;&gt;7&lt;/span&gt;;\n\n}\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;main&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;&lt;/span&gt;{\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; * p = &lt;span class=&quot;hljs-built_in&quot;&gt;foo&lt;/span&gt;();\n    &lt;span class=&quot;hljs-built_in&quot;&gt;boo&lt;/span&gt;();\n    &lt;span class=&quot;hljs-built_in&quot;&gt;printf&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&quot;%d\\n&quot;&lt;/span&gt;,*p);\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;the output probably will be: 7&lt;/p&gt;\n\n&lt;p&gt;That is because after returning from foo() the stack is freed and then reused by boo().\nIf you deassemble the executable you will see it clearly.&lt;/p&gt;\n    ","\n&lt;p&gt;In C++, you &lt;em&gt;can&lt;/em&gt; access any address, but it doesn&apos;t mean you &lt;em&gt;should&lt;/em&gt;. The address you are accessing is no longer valid. It &lt;em&gt;works&lt;/em&gt; because nothing else scrambled the memory after foo returned, but it could crash under many circumstances. Try analyzing your program with &lt;a href=&quot;http://en.wikipedia.org/wiki/Valgrind&quot; rel=&quot;noreferrer&quot;&gt;Valgrind&lt;/a&gt;, or even just compiling it optimized, and see...&lt;/p&gt;\n    ","\n&lt;p&gt;You never throw a C++ exception by accessing invalid memory. You are just giving an example of the general idea of referencing an arbitrary memory location. I could do the same like this:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;unsigned&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; q = &lt;span class=&quot;hljs-number&quot;&gt;123456&lt;/span&gt;;\n\n*(&lt;span class=&quot;hljs-type&quot;&gt;double&lt;/span&gt;*)(q) = &lt;span class=&quot;hljs-number&quot;&gt;1.2&lt;/span&gt;;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Here I am simply treating 123456 as the address of a double and write to it. Any number of things could happen: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;code&gt;q&lt;/code&gt; might in fact genuinely be a valid address of a double, e.g. &lt;code&gt;double p; q = &amp;amp;p;&lt;/code&gt;. &lt;/li&gt;\n&lt;li&gt;&lt;code&gt;q&lt;/code&gt; might point somewhere inside allocated memory and I just overwrite 8 bytes in there. &lt;/li&gt;\n&lt;li&gt;&lt;code&gt;q&lt;/code&gt; points outside allocated memory and the operating system&apos;s memory manager sends a segmentation fault signal to my program, causing the runtime to terminate it. &lt;/li&gt;\n&lt;li&gt;You win the lottery.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The way you set it up it is a bit more reasonable that the returned address points into a valid area of memory, as it will probably just be a little further down the stack, but it is still an invalid location that you cannot access in a deterministic fashion.&lt;/p&gt;\n\n&lt;p&gt;Nobody will automatically check the semantic validity of memory addresses like that for you during normal program execution. However, a memory debugger such as &lt;code&gt;valgrind&lt;/code&gt; will happily do this, so you should run your program through it and witness the errors.&lt;/p&gt;\n    ","\n&lt;p&gt;Did you compile your program with the optimiser enabled? The &lt;code&gt;foo()&lt;/code&gt; function is quite simple and might have been inlined or replaced in the resulting code.&lt;/p&gt;\n\n&lt;p&gt;But I agree with Mark B that the resulting behavior is undefined.&lt;/p&gt;\n    ","\n&lt;p&gt;Your problem has nothing to do with &lt;em&gt;scope&lt;/em&gt;. In the code you show, the function &lt;code&gt;main&lt;/code&gt; does not see the names in the function &lt;code&gt;foo&lt;/code&gt;, so you can&apos;t access &lt;code&gt;a&lt;/code&gt; in foo directly with &lt;em&gt;this&lt;/em&gt; name outside &lt;code&gt;foo&lt;/code&gt;.&lt;/p&gt;\n\n&lt;p&gt;The problem you are having is why the program doesn&apos;t signal an error when referencing illegal memory. This is because C++ standards does not specify a very clear boundary between illegal memory and legal memory. Referencing something in popped out stack sometimes causes error and sometimes not. It depends. Don&apos;t count on this behavior. Assume it will always result in error when you program, but assume it will never signal error when you debug.&lt;/p&gt;\n    ","\n&lt;p&gt;Pay attention to  all warnings . Do not only solve errors.&lt;br&gt;\nGCC shows this Warning &lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;warning: address of local variable &apos;a&apos; returned &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is  power of C++. You should care about memory. With the &lt;code&gt;-Werror&lt;/code&gt; flag, this warning becames an error and now you have to debug it.&lt;/p&gt;\n    ","\n&lt;p&gt;It works because the stack has not been altered (yet) since a was put there. \nCall a few other functions (which are also calling other functions) before accessing &lt;code&gt;a&lt;/code&gt; again and you will probably not be so lucky anymore... ;-)&lt;/p&gt;\n    ","\n&lt;p&gt;You are just returning a memory address, it&apos;s allowed but probably an error.  &lt;/p&gt;\n\n&lt;p&gt;Yes if you try to dereference that memory address you will have undefined behavior.&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; * &lt;span class=&quot;hljs-title&quot;&gt;ref&lt;/span&gt; &lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; &lt;/span&gt;{\n\n &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; tmp = &lt;span class=&quot;hljs-number&quot;&gt;100&lt;/span&gt;;\n &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &amp;amp;tmp;\n}\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;main&lt;/span&gt; &lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; &lt;/span&gt;{\n\n &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; * a = &lt;span class=&quot;hljs-built_in&quot;&gt;ref&lt;/span&gt;();\n &lt;span class=&quot;hljs-comment&quot;&gt;//Up until this point there is defined results&lt;/span&gt;\n &lt;span class=&quot;hljs-comment&quot;&gt;//You can even print the address returned&lt;/span&gt;\n &lt;span class=&quot;hljs-comment&quot;&gt;// but yes probably a bug&lt;/span&gt;\n\n cout &amp;lt;&amp;lt; *a &amp;lt;&amp;lt; endl;&lt;span class=&quot;hljs-comment&quot;&gt;//Undefined results&lt;/span&gt;\n}\n&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;This behavior is undefined, as Alex pointed out--in fact, most compilers will warn against doing this, because it&apos;s an easy way to get crashes.&lt;/p&gt;\n\n&lt;p&gt;For an example of the kind of spooky behavior you are &lt;em&gt;likely&lt;/em&gt; to get, try this sample:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; *&lt;span class=&quot;hljs-title&quot;&gt;a&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;\n&lt;/span&gt;{\n   &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; x = &lt;span class=&quot;hljs-number&quot;&gt;5&lt;/span&gt;;\n   &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &amp;amp;x;\n}\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;b&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;( &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; *c )&lt;/span&gt;\n&lt;/span&gt;{\n   &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; y = &lt;span class=&quot;hljs-number&quot;&gt;29&lt;/span&gt;;\n   *c = &lt;span class=&quot;hljs-number&quot;&gt;123&lt;/span&gt;;\n   cout &amp;lt;&amp;lt; &lt;span class=&quot;hljs-string&quot;&gt;&quot;y=&quot;&lt;/span&gt; &amp;lt;&amp;lt; y &amp;lt;&amp;lt; endl;\n}\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;main&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;\n&lt;/span&gt;{\n   &lt;span class=&quot;hljs-built_in&quot;&gt;b&lt;/span&gt;( &lt;span class=&quot;hljs-built_in&quot;&gt;a&lt;/span&gt;() );\n   &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;;\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;This prints out &quot;y=123&quot;, but your results may vary (really!). Your pointer is clobbering other, unrelated local variables.&lt;/p&gt;\n    ","\n&lt;p&gt;That&apos;s classic &lt;strong&gt;undefined behaviour&lt;/strong&gt; that&apos;s been discussed here not two days ago -- search around the site for a bit. In a nutshell, you were lucky, but anything could have happened and your code is making invalid access to memory.&lt;/p&gt;\n    ","\n&lt;p&gt;You actually invoked undefined behaviour.&lt;/p&gt;\n\n&lt;p&gt;Returning the address of a temporary works, but as temporaries are destroyed at the end of a function the results of accessing them will be undefined.&lt;/p&gt;\n\n&lt;p&gt;So you did not modify &lt;code&gt;a&lt;/code&gt; but rather the memory location where &lt;code&gt;a&lt;/code&gt; once was. This difference is very similar to the difference between crashing and not crashing. &lt;/p&gt;\n    ","\n&lt;p&gt;In typical compiler implementations, you can think of the code as &quot;print out the value of the memory block with adress that &lt;em&gt;used to be&lt;/em&gt; occupied by a&quot;. Also, if you add a new function invocation to a function that constains a local &lt;code&gt;int&lt;/code&gt; it&apos;s a good chance that the value of &lt;code&gt;a&lt;/code&gt; (or the memory address that &lt;code&gt;a&lt;/code&gt; used to point to) changes. This happens because the stack will be overwritten with a new frame containing different data.&lt;/p&gt;\n\n&lt;p&gt;However, this is &lt;em&gt;undefined&lt;/em&gt; behaviour and you should not rely on it to work!&lt;/p&gt;\n    ","\n&lt;p&gt;It can, because &lt;code&gt;a&lt;/code&gt; is a variable allocated temporarily for the lifetime of its scope (&lt;code&gt;foo&lt;/code&gt; function). After you return from &lt;code&gt;foo&lt;/code&gt; the memory is free and can be overwritten.&lt;/p&gt;\n\n&lt;p&gt;What you&apos;re doing is described as &lt;em&gt;undefined behavior&lt;/em&gt;. The result cannot be predicted.&lt;/p&gt;\n    ","\n&lt;p&gt;The things with correct (?) console output can change dramatically if you use ::printf but not cout. \nYou can play around with debugger within below code (tested on x86, 32-bit, MSVisual Studio):&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;char&lt;/span&gt;* &lt;span class=&quot;hljs-title&quot;&gt;foo&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; \n&lt;/span&gt;{\n  &lt;span class=&quot;hljs-type&quot;&gt;char&lt;/span&gt; buf[&lt;span class=&quot;hljs-number&quot;&gt;10&lt;/span&gt;];\n  ::&lt;span class=&quot;hljs-built_in&quot;&gt;strcpy&lt;/span&gt;(buf, &lt;span class=&quot;hljs-string&quot;&gt;&quot;TEST);\n  return buf;\n}\n\nint main() \n{\n  char* s = foo();    //place breakpoint &amp;amp; check &apos;s&apos; varialbe here\n  ::printf(&quot;&lt;/span&gt;%s\\n&lt;span class=&quot;hljs-string&quot;&gt;&quot;, s); \n}\n&lt;/span&gt;&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;It&apos;s &apos;Dirty&apos; way of using memory addresses. When you return an address (pointer) you don&apos;t know whether it belongs to local scope of a function. It&apos;s just an address. Now that you invoked the &apos;foo&apos; function, that address (memory location) of &apos;a&apos; was already allocated there in the (safely, for now at least) addressable memory of your application (process). After the &apos;foo&apos; function returned, the address of &apos;a&apos; can be considered &apos;dirty&apos; but it&apos;s there, not cleaned up, nor disturbed/modified by expressions in other part of program (in this specific case at least). A C/C++ compiler doesn&apos;t stop you from such &apos;dirty&apos; access (might warn you though, if you care). You can safely use (update) any memory location that is in the data segment of your program instance (process) unless you protect the address by some means.&lt;/p&gt;\n    ","\n&lt;p&gt;After returning from a function, all identifiers are destroyed instead of kept values in a memory location and we can not locate the values without having an identifier.But that location still contains the value stored by previous function.&lt;/p&gt;\n\n&lt;p&gt;So, here function &lt;code&gt;foo()&lt;/code&gt; is returning the address of &lt;code&gt;a&lt;/code&gt; and &lt;code&gt;a&lt;/code&gt; is destroyed after returning its address. And you can access the modified value through that returned address.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Let me take a real world example:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Suppose a man hides money at a location and tells you the location. After some time, the man who had told you the money location dies. But still you have the access of that hidden money.&lt;/p&gt;\n    ","\n&lt;p&gt;Your code is very risky. You are creating a local variable (wich is considered destroyed after function ends) and you return the address of memory of that variable after it is destoyed.&lt;/p&gt;\n\n&lt;p&gt;That means the memory address could be valid or not, and your code will be vulnerable to possible memory address issues (for example segmentation fault).&lt;/p&gt;\n\n&lt;p&gt;This means that you are doing a very bad thing, becouse you are passing a memory address to a pointer wich is not trustable at all. &lt;/p&gt;\n\n&lt;p&gt;Consider this example, instead, and test it:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; * &lt;span class=&quot;hljs-title&quot;&gt;foo&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;\n&lt;/span&gt;{\n   &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; *x = &lt;span class=&quot;hljs-keyword&quot;&gt;new&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt;;\n   *x = &lt;span class=&quot;hljs-number&quot;&gt;5&lt;/span&gt;;\n   &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; x;\n}\n\n&lt;span class=&quot;hljs-function&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title&quot;&gt;main&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;\n&lt;/span&gt;{\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt;* p = &lt;span class=&quot;hljs-built_in&quot;&gt;foo&lt;/span&gt;();\n    std::cout &amp;lt;&amp;lt; *p &amp;lt;&amp;lt; &lt;span class=&quot;hljs-string&quot;&gt;&quot;\\n&quot;&lt;/span&gt;; &lt;span class=&quot;hljs-comment&quot;&gt;//better to put a new-line in the output, IMO&lt;/span&gt;\n    *p = &lt;span class=&quot;hljs-number&quot;&gt;8&lt;/span&gt;;\n    std::cout &amp;lt;&amp;lt; *p;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;delete&lt;/span&gt; p;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;;\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Unlike your example, with this example you are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;allocating memory for int into a local function&lt;/li&gt;\n&lt;li&gt;that memory address is still valid also when function expires, (it is not deleted by anyone)&lt;/li&gt;\n&lt;li&gt;the memory address is trustable (that memory block is not considered free, so it will be not overridden until it is deleted)&lt;/li&gt;\n&lt;li&gt;the memory address should be deleted when not used. (see the delete at the end of the program)&lt;/li&gt;\n&lt;/ul&gt;\n    "]},"randomTags":[{"name":"objective-c","slug":"objective-c"},{"name":"android-recyclerview","slug":"android-recyclerview"},{"name":"syntax-error","slug":"syntax-error"},{"name":"el","slug":"el"},{"name":"reference","slug":"reference"},{"name":"php","slug":"php"},{"name":"reactjs","slug":"reactjs"},{"name":"slice","slug":"slice"},{"name":"tidyr","slug":"tidyr"},{"name":"sapply","slug":"sapply"},{"name":"spring-mvc","slug":"spring-mvc"},{"name":"iec10967","slug":"iec10967"},{"name":"identity","slug":"identity"},{"name":"database-normalization","slug":"database-normalization"},{"name":"debugging","slug":"debugging"},{"name":"bit-manipulation","slug":"bit-manipulation"},{"name":"scope","slug":"scope"},{"name":"git-reset","slug":"git-reset"},{"name":"razor","slug":"razor"},{"name":"design-patterns","slug":"design-patterns"}]},"__N_SSG":true}