{"pageProps":{"data":{"answer":["\n&lt;p&gt;OK, you&apos;re defining the problem to where it would seem there is not much room for improvement. That is fairly rare, in my experience. I tried to explain this in a Dr. Dobbs article in November 1993, by starting from a conventionally well-designed non-trivial program with no obvious waste and taking it through a series of optimizations until its wall-clock time was reduced from 48 seconds to 1.1 seconds, and the source code size was reduced by a factor of 4. My diagnostic tool &lt;a href=&quot;https://stackoverflow.com/questions/375913/what-can-i-use-to-profile-c-code-in-linux/378024#378024&quot;&gt;was this&lt;/a&gt;. The sequence of changes was this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The first problem found was use of list clusters (now called &quot;iterators&quot; and &quot;container classes&quot;) accounting for over half the time. Those were replaced with fairly simple code, bringing the time down to 20 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now the largest time-taker is more list-building. As a percentage, it was not so big before, but now it is because the bigger problem was removed. I find a way to speed it up, and the time drops to 17 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now it is harder to find obvious culprits, but there are a few smaller ones that I can do something about, and the time drops to 13 sec.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now I seem to have hit a wall. The samples are telling me exactly what it is doing, but I can&apos;t seem to find anything that I can improve. Then I reflect on the basic design of the program, on its transaction-driven structure, and ask if all the list-searching that it is doing is actually mandated by the requirements of the problem.&lt;/p&gt;\n\n&lt;p&gt;Then I hit upon a re-design, where the program code is actually generated (via preprocessor macros) from a smaller set of source, and in which the program is not constantly figuring out things that the programmer knows are fairly predictable. In other words, don&apos;t &quot;interpret&quot; the sequence of things to do, &quot;compile&quot; it.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;That redesign is done, shrinking the source code by a factor of 4, and the time is reduced to 10 seconds.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Now, because it&apos;s getting so quick, it&apos;s hard to sample, so I give it 10 times as much work to do, but the following times are based on the original workload.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;More diagnosis reveals that it is spending time in queue-management. In-lining these reduces the time to 7 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now a big time-taker is the diagnostic printing I had been doing. Flush that - 4 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Now the biggest time-takers are calls to &lt;em&gt;malloc&lt;/em&gt; and &lt;em&gt;free&lt;/em&gt;. Recycle objects - 2.6 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Continuing to sample, I still find operations that are not strictly necessary - 1.1 seconds.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Total speedup factor: 43.6&lt;/p&gt;\n\n&lt;p&gt;Now no two programs are alike, but in non-toy software I&apos;ve always seen a progression like this. First you get the easy stuff, and then the more difficult, until you get to a point of diminishing returns. Then the insight you gain may well lead to a redesign, starting a new round of speedups, until you again hit diminishing returns. Now this is the point at which it might make sense to wonder whether &lt;code&gt;++i&lt;/code&gt; or &lt;code&gt;i++&lt;/code&gt; or &lt;code&gt;for(;;)&lt;/code&gt; or &lt;code&gt;while(1)&lt;/code&gt; are faster: the kinds of questions I see so often on Stack&amp;nbsp;Overflow.&lt;/p&gt;\n\n&lt;p&gt;P.S. It may be wondered why I didn&apos;t use a profiler. The answer is that almost every one of these &quot;problems&quot; was a function call site, which stack samples pinpoint. Profilers, even today, are just barely coming around to the idea that statements and call instructions are more important to locate, and easier to fix, than whole functions.&lt;/p&gt;\n\n&lt;p&gt;I actually built a profiler to do this, but for a real down-and-dirty intimacy with what the code is doing, there&apos;s no substitute for getting your fingers right in it. It is not an issue that the number of samples is small, because none of the problems being found are so tiny that they are easily missed.&lt;/p&gt;\n\n&lt;p&gt;ADDED: jerryjvl requested some examples. Here is the first problem. It consists of a small number of separate lines of code, together taking over half the time:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; /* IF ALL TASKS DONE, SEND ITC_ACKOP, AND DELETE OP */\nif (ptop-&amp;gt;current_task &amp;gt;= ILST_LENGTH(ptop-&amp;gt;tasklist){\n. . .\n/* FOR EACH OPERATION REQUEST */\nfor ( ptop = ILST_FIRST(oplist); ptop != NULL; ptop = ILST_NEXT(oplist, ptop)){\n. . .\n/* GET CURRENT TASK */\nptask = ILST_NTH(ptop-&amp;gt;tasklist, ptop-&amp;gt;current_task)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;These were using the list cluster ILST (similar to a list class). They are implemented in the usual way, with &quot;information hiding&quot; meaning that the users of the class were not supposed to have to care how they were implemented. When these lines were written (out of roughly 800 lines of code) thought was not given to the idea that these could be a &quot;bottleneck&quot; (I hate that word). They are simply the recommended way to do things. It is easy to say &lt;em&gt;in hindsight&lt;/em&gt; that these should have been avoided, but in my experience &lt;em&gt;all&lt;/em&gt; performance problems are like that. In general, it is good to try to avoid creating performance problems. It is even better to find and fix the ones that are created, even though they &quot;should have been avoided&quot; (in hindsight). I hope that gives a bit of the flavor.&lt;/p&gt;\n\n&lt;p&gt;Here is the second problem, in two separate lines:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt; /* ADD TASK TO TASK LIST */\nILST_APPEND(ptop-&amp;gt;tasklist, ptask)\n. . .\n/* ADD TRANSACTION TO TRANSACTION QUEUE */\nILST_APPEND(trnque, ptrn)\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;These are building lists by appending items to their ends. (The fix was to collect the items in arrays, and build the lists all at once.) The interesting thing is that these statements only cost (i.e. were on the call stack) 3/48 of the original time, so they were not in fact a big problem &lt;em&gt;at the beginning&lt;/em&gt;. However, after removing the first problem, they cost 3/20 of the time and so were now a &quot;bigger fish&quot;. In general, that&apos;s how it goes.&lt;/p&gt;\n\n&lt;p&gt;I might add that this project was distilled from a real project I helped on. In that project, the performance problems were far more dramatic (as were the speedups), such as calling a database-access routine within an inner loop to see if a task was finished.&lt;/p&gt;\n\n&lt;p&gt;REFERENCE ADDED:\nThe source code, both original and redesigned, can be found in &lt;a href=&quot;http://www.drdobbs.com/parallel/performance-tuning-slugging-it-out/184409106&quot; rel=&quot;noreferrer&quot;&gt;www.ddj.com&lt;/a&gt;, for 1993, in file 9311.zip, files slug.asc and slug.zip.&lt;/p&gt;\n\n&lt;p&gt;EDIT 2011/11/26:\nThere is now a &lt;a href=&quot;https://sourceforge.net/projects/randompausedemo/&quot; rel=&quot;noreferrer&quot;&gt;SourceForge project&lt;/a&gt; containing source code in Visual C++ and a blow-by-blow description of how it was tuned. It only goes through the first half of the scenario described above, and it doesn&apos;t follow exactly the same sequence, but still gets a 2-3 order of magnitude speedup.&lt;/p&gt;\n    ","\n&lt;p&gt;Suggestions:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Pre-compute rather than re-calculate&lt;/strong&gt;: any loops or repeated calls that contain calculations that have a relatively limited range of inputs, consider making a lookup (array or dictionary) that contains the result of that calculation for all values in the valid range of inputs. Then use a simple lookup inside the algorithm instead.&lt;br&gt;\n&lt;em&gt;Down-sides&lt;/em&gt;: if few of the pre-computed values are actually used this may make matters worse, also the lookup may take significant memory.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&apos;t use library methods&lt;/strong&gt;: most libraries need to be written to operate correctly under a broad range of scenarios, and perform null checks on parameters, etc. By re-implementing a method you may be able to strip out a lot of logic that does not apply in the exact circumstance you are using it.&lt;br&gt;\n&lt;em&gt;Down-sides&lt;/em&gt;: writing additional code means more surface area for bugs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Do use library methods&lt;/strong&gt;: to contradict myself, language libraries get written by people that are a lot smarter than you or me; odds are they did it better and faster. Do not implement it yourself unless you can actually make it faster (i.e.: always measure!)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Cheat&lt;/strong&gt;: in some cases although an exact calculation may exist for your problem, you may not need &apos;exact&apos;, sometimes an approximation may be &apos;good enough&apos; and a lot faster in the deal. Ask yourself, does it really matter if the answer is out by 1%? 5%? even 10%?&lt;br&gt;\n&lt;em&gt;Down-sides&lt;/em&gt;: Well... the answer won&apos;t be exact.&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;When you can&apos;t improve the performance any more - see if you can improve the &lt;strong&gt;perceived&lt;/strong&gt; performance instead.&lt;/p&gt;\n\n&lt;p&gt;You may not be able to make your fooCalc algorithm faster, but often there are ways to make your application seem more responsive to the user. &lt;/p&gt;\n\n&lt;p&gt;A few examples:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;anticipating what the user is going\nto request and start working on that\nbefore then&lt;/li&gt;\n&lt;li&gt;displaying results as\nthey come in, instead of all at once\nat the end&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Accurate&lt;/em&gt; progress meter&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;These won&apos;t make your program faster, but it might make your users happier with the speed you have.&lt;/p&gt;\n    ","\n&lt;p&gt;I spend most of my life in just this place. The broad strokes are to run your profiler and get it to record:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Cache misses&lt;/strong&gt;. Data cache is the #1 source of stalls in most programs. Improve cache hit rate by reorganizing offending data structures to have better locality; pack structures and numerical types down to eliminate wasted bytes (and therefore wasted cache fetches); prefetch data wherever possible to reduce stalls.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Load-hit-stores&lt;/strong&gt;. Compiler assumptions about pointer aliasing, and cases where data is moved between disconnected register sets via memory, can cause a certain pathological behavior that causes the entire CPU pipeline to clear on a load op. Find places where floats, vectors, and ints are being cast to one another and eliminate them. Use &lt;code&gt;__restrict&lt;/code&gt; liberally to promise the compiler about aliasing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Microcoded operations&lt;/strong&gt;. Most processors have some operations that cannot be pipelined, but instead run a tiny subroutine stored in ROM. Examples on the PowerPC are integer multiply, divide, and shift-by-variable-amount. The problem is that the entire pipeline stops dead while this operation is executing. Try to eliminate use of these operations or at least break them down into their constituent pipelined ops so you can get the benefit of superscalar dispatch on whatever the rest of your program is doing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Branch mispredicts&lt;/strong&gt;. These too empty the pipeline. Find cases where the CPU is spending a lot of time refilling the pipe after a branch, and use branch hinting if available to get it to predict correctly more often. Or better yet, replace branches with conditional-moves wherever possible, &lt;em&gt;especially&lt;/em&gt; after floating point operations because their pipe is usually deeper and reading the condition flags after fcmp can cause a stall.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sequential floating-point ops&lt;/strong&gt;. Make these SIMD.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And one more thing I like to do:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Set your compiler to output assembly listings&lt;/strong&gt; and look at what it emits for the hotspot functions in your code. All those clever optimizations that &quot;a good compiler should be able to do for you automatically&quot;? Chances are your actual compiler doesn&apos;t do them. I&apos;ve seen GCC emit truly WTF code.&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Throw more hardware at it!&lt;/p&gt;\n    ","\n&lt;p&gt;More suggestions:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Avoid I/O&lt;/strong&gt;: Any I/O (disk, network, ports, etc.) is\nalways going to be far slower than any code that is\nperforming calculations, so get rid of any I/O that you do\nnot strictly need.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Move I/O up-front&lt;/strong&gt;: Load up all the data you are going\nto need for a calculation up-front, so that you do not\nhave repeated I/O waits within the core of a critical\nalgorithm (and maybe as a result repeated disk seeks, when\nloading all the data in one hit may avoid seeking).&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Delay I/O&lt;/strong&gt;: Do not write out your results until the\ncalculation is over, store them in a data structure and\nthen dump that out in one go at the end when the hard work\nis done.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Threaded I/O&lt;/strong&gt;: For those daring enough, combine &apos;I/O\nup-front&apos; or &apos;Delay I/O&apos; with the actual calculation by\nmoving the loading into a parallel thread, so that while\nyou are loading more data you can work on a calculation on\nthe data you already have, or while you calculate the next\nbatch of data you can simultaneously write out the results\nfrom the last batch.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Since many of the performance problems involve database issues, I&apos;ll give you some specific things to look at when tuning queries and stored procedures.&lt;/p&gt;\n\n&lt;p&gt;Avoid cursors in most databases. Avoid looping as well. Most of the time, data access should be set-based, not record by record processing. This includes not reusing a single record stored procedure when you want to insert 1,000,000 records at once.&lt;/p&gt;\n\n&lt;p&gt;Never use select *, only return the fields you actually need. This is especially true if there are any joins as the join fields will be repeated and thus cause unnecesary load on both the server and the network.&lt;/p&gt;\n\n&lt;p&gt;Avoid the use of correlated subqueries. Use joins (including joins to derived tables where possible) (I know this is true for Microsoft SQL Server, but test the advice when using a differnt backend).&lt;/p&gt;\n\n&lt;p&gt;Index, index, index. And get those stats updated if applicable to your database.&lt;/p&gt;\n\n&lt;p&gt;Make the query &lt;a href=&quot;http://en.wikipedia.org/wiki/Sargable&quot; rel=&quot;noreferrer&quot;&gt;sargable&lt;/a&gt;. Meaning avoid things which make it impossible to use the indexes such as using a wildcard in the first character of a like clause or a function in the join or as the left part of a where statement.&lt;/p&gt;\n\n&lt;p&gt;Use correct data types. It is faster to do date math on a date field than to have to try to convert a string datatype to a date datatype, then do the calculation.&lt;/p&gt;\n\n&lt;p&gt;Never put a loop of any kind into a trigger!&lt;/p&gt;\n\n&lt;p&gt;Most databases have a way to check how the query execution will be done. In Microsoft SQL Server this is called an execution plan. Check those first to see where problem areas lie.&lt;/p&gt;\n\n&lt;p&gt;Consider how often the query runs as well as how long it takes to run when determining what needs to be optimized. Sometimes you can gain more perfomance from a slight tweak to a query that runs millions of times a day than you can from wiping time off a long_running query that only runs once a month.&lt;/p&gt;\n\n&lt;p&gt;Use some sort of profiler tool to find out what is really being sent to and from the database. I can remember one time in the past where we couldn&apos;t figure out why the page was so slow to load when the stored procedure was fast and found out through profiling that the webpage was asking for the query many many times instead of once. &lt;/p&gt;\n\n&lt;p&gt;The profiler will also help you to find who are blocking who. Some queries that execute quickly while running alone may become really slow due to locks from other queries.&lt;/p&gt;\n    ","\n&lt;p&gt;The single most important limiting factor today is the &lt;strong&gt;limited memory bandwitdh&lt;/strong&gt;. Multicores are just making this worse, as the bandwidth is shared betwen cores. Also, the limited chip area devoted to implementing caches is also divided among the cores and threads, worsening this problem even more. Finally, the inter-chip signalling needed to keep the different caches coherent also increase with an increased number of cores. This also adds a penalty.&lt;/p&gt;\n\n&lt;p&gt;These are the effects that you need to manage. Sometimes through micro managing your code, but sometimes through careful consideration and refactoring.&lt;/p&gt;\n\n&lt;p&gt;A lot of comments already mention cache friendly code. There are at least two distinct flavors of this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Avoid memory fetch latencies.&lt;/li&gt;\n&lt;li&gt;Lower memory bus pressure (bandwidth).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The first problem specifically has to do with making your data access patterns more regular, allowing the hardware prefetcher to work efficiently. Avoid dynamic memory allocation which spreads your data objects around in memory. Use linear containers instead of linked lists, hashes and trees.&lt;/p&gt;\n\n&lt;p&gt;The second problem has to do with improving data reuse. Alter your algorithms to work on subsets of your data that do fit in available cache, and reuse that data as much as possible while it is still in the cache.&lt;/p&gt;\n\n&lt;p&gt;Packing data tighter and making sure you use all data in cache lines in the hot loops, will help avoid these other effects, and allow fitting more &lt;em&gt;useful&lt;/em&gt; data in the cache.&lt;/p&gt;\n    ","\n&lt;ul&gt;\n&lt;li&gt;What hardware are you running on? Can you use platform-specific optimizations (like vectorization)?&lt;/li&gt;\n&lt;li&gt;Can you get a better compiler? E.g. switch from GCC to Intel?&lt;/li&gt;\n&lt;li&gt;Can you make your algorithm run in parallel?&lt;/li&gt;\n&lt;li&gt;Can you reduce cache misses by reorganizing data?&lt;/li&gt;\n&lt;li&gt;Can you disable asserts?&lt;/li&gt;\n&lt;li&gt;Micro-optimize for your compiler and platform. In the style of, &quot;at an if/else, put the most common statement first&quot;&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Although I like Mike Dunlavey&apos;s answer, in fact it is a great answer indeed with supporting example, I think it could be expressed very simply thus:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Find out what takes the largest amounts of time first, and understand why.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It is the identification process of the time hogs that helps you understand where you must refine your algorithm. This is the only all-encompassing language agnostic answer I can find to a problem that&apos;s already supposed to be fully optimised. Also presuming you want to be architecture independent in your quest for speed.&lt;/p&gt;\n\n&lt;p&gt;So while the algorithm may be optimised, the implementation of it may not be. The identification allows you to know which part is which: algorithm or implementation. So whichever hogs the time the most is your prime candidate for review. But since you say you want to squeeze the last few % out, you might want to also examine the lesser parts, the parts that you have not examined that closely at first.&lt;/p&gt;\n\n&lt;p&gt;Lastly a bit of trial and error with performance figures on different ways to implement the same solution, or potentially different algorithms, can bring insights that help identify time wasters and time savers.&lt;/p&gt;\n\n&lt;p&gt;HPH,\nasoudmove.&lt;/p&gt;\n    ","\n&lt;p&gt;You should probably consider the &quot;Google perspective&quot;, i.e. determine how your application can become largely parallelized and concurrent, which will inevitably also mean at some point to look into distributing your application across different machines and networks, so that it can ideally scale almost linearly with the hardware that you throw at it.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, the Google folks are also known for throwing lots of manpower and resources at solving some of the issues in projects, tools and infrastructure they are using, such as for example &lt;a href=&quot;http://gcc.gnu.org/wiki/LinkTimeOptimization&quot; rel=&quot;noreferrer&quot;&gt;whole program optimization for gcc&lt;/a&gt; by having a dedicated team of engineers hacking gcc internals in order to prepare it for Google-typical use case scenarios.&lt;/p&gt;\n\n&lt;p&gt;Similarly, profiling an application no longer means to simply profile the program code, but also all its surrounding systems and infrastructure (think networks, switches, server, RAID arrays) in order to identify redundancies and optimization potential from a system&apos;s point of view.&lt;/p&gt;\n    ","\n&lt;ul&gt;\n&lt;li&gt;Inline routines (eliminate call/return and parameter pushing)&lt;/li&gt;\n&lt;li&gt;Try eliminating tests/switches with table look ups (if they&apos;re faster)&lt;/li&gt;\n&lt;li&gt;Unroll loops (Duff&apos;s device) to the point where they just fit in the CPU cache&lt;/li&gt;\n&lt;li&gt;Localize memory access so as not to blow your cache&lt;/li&gt;\n&lt;li&gt;Localize related calculations if the optimizer isn&apos;t already doing that&lt;/li&gt;\n&lt;li&gt;Eliminate loop invariants if the optimizer isn&apos;t already doing that&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;ul&gt;\n&lt;li&gt;When you get to the point that you&apos;re using efficient algorithms its a question of what you need more &lt;strong&gt;speed or memory&lt;/strong&gt;. Use caching to &quot;pay&quot; in memory for more speed or use calculations to reduce the memory footprint.&lt;/li&gt;\n&lt;li&gt;If possible (and more cost effective) &lt;strong&gt;throw hardware at the problem&lt;/strong&gt; - faster CPU, more memory or HD could solve the problem faster then trying to code it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Use parallelization&lt;/strong&gt; if possible - run part of the code on multiple threads.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Use the right tool for the job&lt;/strong&gt;. some programing languages create more efficient code, using managed code (i.e. Java/.NET) speed up development but native programing languages creates faster running code. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Micro optimize&lt;/strong&gt;. Only were applicable you can use optimized assembly to speed small pieces of code, using SSE/vector optimizations in the right places can greatly increase performance.&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;&lt;strong&gt;Divide and conquer&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;If the dataset being processed is too large, loop over chunks of it. If you&apos;ve done your code right, implementation should be easy. If you have a monolithic program, now you know better.&lt;/p&gt;\n    ","\n&lt;p&gt;First of all, as mentioned in several prior answers, learn what bites your performance - is it memory or processor or network or database or something else. Depending on that...&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;...if it&apos;s memory - find one of the books written long time ago by Knuth, one of &quot;The Art of Computer Programming&quot; series. Most likely it&apos;s one about sorting and search - if my memory is wrong then you&apos;ll have to find out in which he talks about how to deal with slow tape data storage. Mentally transform his &lt;em&gt;memory/tape&lt;/em&gt; pair into your pair of cache/main memory (or in pair of L1/L2 cache) respectively. Study all the tricks he describes - if you don&apos;s find something that solves your problem, then hire professional computer scientist to conduct a professional research. If your memory issue is by chance with FFT (cache misses at bit-reversed indexes when doing radix-2 butterflies) then don&apos;t hire a scientist - instead, manually optimize passes one-by-one until you&apos;re either win or get to dead end. You mentioned &lt;em&gt;squeeze out up to the last few percent&lt;/em&gt; right? If it&apos;s &lt;em&gt;few&lt;/em&gt; indeed you&apos;ll most likely win.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;...if it&apos;s processor - switch to assembly language. Study processor specification - &lt;em&gt;what takes ticks&lt;/em&gt;, VLIW, SIMD. Function calls are most likely replaceable tick-eaters. Learn loop transformations - pipeline, unroll. Multiplies and divisions might be replaceable / interpolated with bit shifts (multiplies by small integers might be replaceable with additions). Try tricks with shorter data - if you&apos;re lucky one instruction with 64 bits might turn out replaceable with two on 32 or even 4 on 16 or 8 on 8 bits go figure. Try also &lt;em&gt;longer&lt;/em&gt; data - eg your float calculations might turn out slower than double ones at particular processor. If you have trigonometric stuff, fight it with pre-calculated tables; also keep in mind that sine of small value might be replaced with that value if loss of precision is within allowed limits.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;...if it&apos;s network - think of compressing data you pass over it. Replace XML transfer with binary. Study protocols. Try UDP instead of TCP if you can somehow handle data loss.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;...if it&apos;s database, well, go to any database forum and ask for advice. In-memory data-grid, optimizing query plan etc etc etc.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;HTH :)&lt;/p&gt;\n    ","\n&lt;p&gt;&lt;strong&gt;Caching!&lt;/strong&gt; A cheap way (in programmer effort) to make almost anything faster is to add a caching abstraction layer to any data movement area of your program. Be it I/O or just passing/creation of objects or structures. Often it&apos;s easy to add caches to factory classes and reader/writers.&lt;/p&gt;\n\n&lt;p&gt;Sometimes the cache will not gain you much, but it&apos;s an easy method to just add caching all over and then disable it where it doesn&apos;t help. I&apos;ve often found this to gain huge performance without having to micro-analyse the code.&lt;/p&gt;\n    ","\n&lt;p&gt;I think this has already been said in a different way.  But when you&apos;re dealing with a processor intensive algorithm, you should simplify everything inside the most inner loop at the expense of everything else.  &lt;/p&gt;\n\n&lt;p&gt;That may seem obvious to some, but it&apos;s something I try to focus on regardless of the language I&apos;m working with.  If you&apos;re dealing with nested loops, for example, and you find an opportunity to take some code down a level, you can in some cases drastically speed up your code.  As another example, there are the little things to think about like working with integers instead of floating point variables whenever you can, and using multiplication instead of division whenever you can.  Again, these are things that should be considered for your most inner loop.  &lt;/p&gt;\n\n&lt;p&gt;Sometimes you may find benefit of performing your math operations on an integer inside the inner loop, and then scaling it down to a floating point variable you can work with afterwards.  That&apos;s an example of sacrificing speed in one section to improve the speed in another, but in some cases the pay off can be well worth it.&lt;/p&gt;\n    ","\n&lt;p&gt;I&apos;ve spent some time working on optimising client/server business systems operating over low-bandwidth and long-latency networks (e.g. satellite, remote, offshore), and been able to achieve some dramatic performance improvements with a fairly repeatable process.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Measure&lt;/strong&gt;: Start by understanding the network&apos;s underlying capacity and topology. Talking to the relevant networking people in the business, and make use of basic tools such as ping and traceroute to establish (at a minimum) the network latency from each client location, during typical operational periods. Next, take accurate time measurements of specific end user functions that display the problematic symptoms. Record all of these measurements, along with their locations, dates and times. Consider building end-user &quot;network performance testing&quot; functionality into your client application, allowing your power users to participate in the process of improvement; empowering them like this can have a &lt;em&gt;huge&lt;/em&gt; psychological impact when you&apos;re dealing with users frustrated by a poorly performing system.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Analyze&lt;/strong&gt;: Using any and all logging methods available to establish exactly what data is being transmitted and received during the execution of the affected operations. Ideally, your application can capture data transmitted and received by both the client and the server. If these include timestamps as well, even better. If sufficient logging isn&apos;t available (e.g. closed system, or inability to deploy modifications into a production environment), use a network sniffer and make sure you really understand what&apos;s going on at the network level.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Cache&lt;/strong&gt;: Look for cases where static or infrequently changed data is being transmitted repetitively and consider an appropriate caching strategy. Typical examples include &quot;pick list&quot; values or other &quot;reference entities&quot;, which can be surprisingly large in some business applications. In many cases, users can accept that they must restart or refresh the application to update infrequently updated data, especially if it can shave significant time from the display of commonly used user interface elements. Make sure you understand the real behaviour of the caching elements already deployed - many common caching methods (e.g. HTTP ETag) still require a network round-trip to ensure consistency, and where network latency is expensive, you may be able to avoid it altogether with a different caching approach.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Parallelise&lt;/strong&gt;: Look for sequential transactions that don&apos;t logically need to be issued strictly sequentially, and rework the system to issue them in parallel. I dealt with one case where an end-to-end request had an inherent network delay of ~2s, which was not a problem for a single transaction, but when 6 sequential 2s round trips were required before the user regained control of the client application, it became a huge source of frustration. Discovering that these transactions were in fact independent allowed them to be executed in parallel, reducing the end-user delay to very close to the cost of a single round trip.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Combine&lt;/strong&gt;: Where sequential requests &lt;em&gt;must&lt;/em&gt; be executed sequentially, look for opportunities to combine them into a single more comprehensive request. Typical examples include creation of new entities, followed by requests to relate those entities to other existing entities.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Compress&lt;/strong&gt;: Look for opportunities to leverage compression of the payload, either by replacing a textual form with a binary one, or using actual compression technology. Many modern (i.e. within a decade) technology stacks support this almost transparently, so make sure it&apos;s configured. I have often been surprised by the significant impact of compression where it seemed clear that the problem was fundamentally latency rather than bandwidth,  discovering after the fact that it allowed the transaction to fit within a single packet or otherwise avoid packet loss and therefore have an outsize impact on performance.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Repeat&lt;/strong&gt;: Go back to the beginning and re-measure your operations (at the same locations and times) with the improvements in place, record and report your results. As with all optimisation, some problems may have been solved exposing others that now dominate.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In the steps above, I focus on the application related optimisation process, but of course you must ensure the underlying network itself is configured in the most efficient manner to support your application too. Engage the networking specialists in the business and determine if they&apos;re able to apply capacity improvements, QoS, network compression, or other techniques to address the problem. Usually, they will not understand your application&apos;s needs, so it&apos;s important that you&apos;re equipped (after the Analyse step) to discuss it with them, and also to make the business case for any costs you&apos;re going to be asking them to incur. I&apos;ve encountered cases where erroneous network configuration caused the applications data to be transmitted over a slow satellite link rather than an overland link, simply because it was using a TCP port that was not &quot;well known&quot; by the networking specialists; obviously rectifying a problem like this can have a dramatic impact on performance, with no software code or configuration changes necessary at all.&lt;/p&gt;\n    ","\n&lt;p&gt;Very difficult to give a generic answer to this question. It really depends on your problem domain and technical implementation. A general technique that is fairly language neutral: Identify code hotspots that cannot be eliminated, and hand-optimize assembler code. &lt;/p&gt;\n    ","\n&lt;p&gt;Last few % is a very CPU and application dependent thing....&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;cache architectures differ, some chips have on-chip RAM\nyou can map directly, ARM&apos;s (sometimes) have a vector\nunit, SH4&apos;s a useful matrix opcode. Is there a &lt;a href=&quot;http://en.wikipedia.org/wiki/Graphics_processing_unit&quot; rel=&quot;noreferrer&quot;&gt;GPU&lt;/a&gt; -\nmaybe a shader is the way to go. &lt;a href=&quot;http://en.wikipedia.org/wiki/Texas_Instruments_TMS320&quot; rel=&quot;noreferrer&quot;&gt;TMS320&lt;/a&gt;&apos;s are very\nsensitive to branches within loops (so separate loops and\nmove conditions outside if possible).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The list goes on.... But these sorts of things really are\nthe last resort...&lt;/p&gt;\n\n&lt;p&gt;Build for x86, and run &lt;a href=&quot;http://en.wikipedia.org/wiki/Valgrind&quot; rel=&quot;noreferrer&quot;&gt;Valgrind&lt;/a&gt;/Cachegrind against the code\nfor proper performance profiling. Or Texas Instruments&apos;\n&lt;a href=&quot;http://en.wikipedia.org/wiki/Code_Composer_Studio&quot; rel=&quot;noreferrer&quot;&gt;CCStudio&lt;/a&gt; has a sweet profiler. Then you&apos;ll really know where\nto focus...&lt;/p&gt;\n    ","\n&lt;p&gt;Not nearly as in depth or complex as previous answers, but here goes:\n(these are more beginner/intermediate level)&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;obvious: dry&lt;/li&gt;\n&lt;li&gt;run loops backwards so you&apos;re always comparing to 0 rather than a variable&lt;/li&gt;\n&lt;li&gt;use bitwise operators whenever you can&lt;/li&gt;\n&lt;li&gt;break repetitive code into modules/functions&lt;/li&gt;\n&lt;li&gt;cache objects&lt;/li&gt;\n&lt;li&gt;local variables have slight performance advantage&lt;/li&gt;\n&lt;li&gt;limit string manipulation as much as possible &lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;&lt;code&gt;Did you know that a CAT6 cable is capable of 10x better shielding off external inteferences than a default Cat5e UTP cable?&lt;/code&gt;&lt;/p&gt;\n&lt;p&gt;For any non-offline projects, while having best software and best hardware, if your throughoutput is weak, then that thin line is going to squeeze data and give you delays, albeit in milliseconds...&lt;/p&gt;\n&lt;p&gt;Also the maximum throughput is higher on CAT6 cables because there is a higher chance that you will actually receive a cable whose strands exist of cupper cores, instead of CCA, Cupper Cladded Aluminium, which is often fount in all your standard CAT5e cables.&lt;/p&gt;\n&lt;p&gt;I if you are facing lost packets, packet drops, then an increase in throughput reliability for 24/7 operation can make the difference that you may be looking for.&lt;/p&gt;\n&lt;p&gt;For those who seek the ultimate in home/office connection reliability, (&lt;em&gt;and are willing to say NO to this years fastfood restaurants, at the end of the year you can there you can&lt;/em&gt;) gift yourself &lt;code&gt;the pinnacle of LAN connectivity in the form of  CAT7 cable&lt;/code&gt; from a reputable brand.&lt;/p&gt;\n    ","\n&lt;p&gt;Impossible to say. It depends on what the code looks like. If we can assume that the code already exists, then we can simply look at it and figure out from that, how to optimize it.&lt;/p&gt;\n\n&lt;p&gt;Better cache locality, loop unrolling, Try to eliminate long dependency chains, to get better instruction-level parallelism. Prefer conditional moves over branches when possible. Exploit SIMD instructions when possible.&lt;/p&gt;\n\n&lt;p&gt;Understand what your code is doing, and understand the hardware it&apos;s running on. Then it becomes fairly simple to determine what you need to do to improve performance of your code. That&apos;s really the only truly general piece of advice I can think of.&lt;/p&gt;\n\n&lt;p&gt;Well, that, and &quot;Show the code on SO and ask for optimization advice for that specific piece of code&quot;.&lt;/p&gt;\n    ","\n&lt;p&gt;If better hardware is an option then definitely go for that. Otherwise&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Check you are using the best compiler and linker options.&lt;/li&gt;\n&lt;li&gt;If hotspot routine in different library to frequent caller, consider moving or cloning it to the callers module. Eliminates some of the call overhead and may improve cache hits (cf how AIX links strcpy() statically into separately linked shared objects). This could of course decrease cache hits also, which is why one measure.&lt;/li&gt;\n&lt;li&gt;See if there is any possibility of using a specialized version of the hotspot routine. Downside is more than one version to maintain.&lt;/li&gt;\n&lt;li&gt;Look at the assembler. If you think it could be better, consider why the compiler did not figure this out, and how you could help the compiler.&lt;/li&gt;\n&lt;li&gt;Consider: are you really using the best algorithm? Is it the best algorithm for your input size?&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;The google way is one option &quot;Cache it.. Whenever possible don&apos;t touch the disk&quot;&lt;/p&gt;\n    ","\n&lt;p&gt;Here are some quick and dirty optimization techniques I use.  I consider this to be a &apos;first pass&apos; optimization.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Learn where the time is spent&lt;/strong&gt; Find out exactly what is taking the time.  Is it file  IO?  Is it CPU time?  Is it the network?  Is it the Database?  It&apos;s useless to optimize for IO if that&apos;s not the bottleneck.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Know Your Environment&lt;/strong&gt;  Knowing where to optimize typically depends on the development environment.  In VB6, for example, passing by reference is slower than passing by value, but in C and C++, by reference is vastly faster.  In C, it is reasonable to try something and do something different if a return code indicates a failure, while in Dot Net, catching exceptions are much slower than checking for a valid condition before attempting.  &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Indexes&lt;/strong&gt; Build indexes on frequently queried database fields.  You can almost always trade space for speed.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Avoid lookups&lt;/strong&gt;  Inside of the loop to be optimized, I avoid having to do any lookups.  Find the offset and/or index outside of the loop and reuse the data inside.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Minimize IO&lt;/strong&gt; try to design in a manner that reduces the number of times you have to read or write especially over a networked connection&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Reduce Abstractions&lt;/strong&gt; The more layers of abstraction the code has to work through, the slower it is.  Inside the critical loop, reduce abstractions (e.g. reveal lower-level methods that avoid extra code)&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Spawn Threads&lt;/strong&gt; for projects with a user interface, spawning a new thread to preform slower tasks makes the application &lt;em&gt;feel&lt;/em&gt; more responsive, although isn&apos;t.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Pre-process&lt;/strong&gt; You can generally trade space for speed.  If there are calculations or other intense operations, see if you can precompute some of the information before you&apos;re in the critical loop.&lt;/p&gt;\n    ","\n&lt;p&gt;If you have a lot of highly parallel floating point math-especially single-precision-try offloading it to a graphics processor (if one is present) using OpenCL or (for NVidia chips) CUDA. GPUs have immense floating point computing power in their shaders, which is much greater than that of a CPU.&lt;/p&gt;\n    ","\n&lt;p&gt;Adding this answer since I didnt see it included in all the others.&lt;/p&gt;\n\n&lt;h3&gt;Minimize implicit conversion between types and sign:&lt;/h3&gt;\n\n&lt;p&gt;This applies to C/C++ at least, Even if you already &lt;em&gt;think&lt;/em&gt; you&apos;re free of conversions - sometimes its good to test adding compiler warnings around functions that require performance, especially watch-out for conversions within loops.&lt;/p&gt;\n\n&lt;p&gt;GCC spesific: You can test this by adding some verbose pragmas around your code,&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;#ifdef __GNUC__\n#  pragma GCC diagnostic push\n#  pragma GCC diagnostic error &quot;-Wsign-conversion&quot;\n#  pragma GCC diagnostic error &quot;-Wdouble-promotion&quot;\n#  pragma GCC diagnostic error &quot;-Wsign-compare&quot;\n#  pragma GCC diagnostic error &quot;-Wconversion&quot;\n#endif\n\n/* your code */\n\n#ifdef __GNUC__\n#  pragma GCC diagnostic pop\n#endif\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;I&apos;ve seen cases where you can get a few percent speedup by reducing conversions raised by warnings like this.&lt;/p&gt;\n\n&lt;p&gt;In some cases I have a header with strict warnings that I keep included to prevent accidental conversions, however this is a trade-off since you may end up adding a lot of casts to quiet intentional conversions which may just make the code more cluttered for minimal gains.&lt;/p&gt;\n    ","\n&lt;p&gt;Sometimes changing the layout of your data can help. In C, you might switch from an array or structures to a structure of arrays, or vice versa.&lt;/p&gt;\n    ","\n&lt;p&gt;&lt;strong&gt;Tweak the OS and framework.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It may sound an overkill but think about it like this: Operating Systems and Frameworks are designed to do many things. Your application only does very specific things. If you could get the OS do to exactly what your application needs and have your application understand how the the framework (php,.net,java) works, you could get much better out of your hardware.&lt;/p&gt;\n\n&lt;p&gt;Facebook, for example, changed some &lt;a href=&quot;http://www.facebook.com/video/video.php?v=631826881803&quot; rel=&quot;nofollow noreferrer&quot;&gt;kernel level thingys&lt;/a&gt; in Linux, changed how memcached works (for example they wrote a memcached proxy, and &lt;a href=&quot;http://www.facebook.com/note.php?note_id=39391378919&quot; rel=&quot;nofollow noreferrer&quot;&gt;used udp instead of tcp&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;Another example for this is Window2008. Win2K8 has a version were you can install just the basic OS needed to run X applicaions (e.g. Web-Apps, Server Apps). This reduces much of the overhead that the OS have on running processes and gives you better performance.&lt;/p&gt;\n\n&lt;p&gt;Of course, you should always throw in more hardware as the first step...&lt;/p&gt;\n    "],"id":560,"title":"Performance optimization strategies of last resort [closed]","content":"\n                    &lt;div&gt;\n            &lt;aside class=&quot;s-notice s-notice__info post-notice js-post-notice mb16&quot; role=&quot;status&quot;&gt;\n        &lt;div class=&quot;d-flex fd-column fw-nowrap&quot;&gt;\n            &lt;div class=&quot;d-flex fw-nowrap&quot;&gt;\n                &lt;div class=&quot;flex--item wmn0 fl1 lh-lg&quot;&gt;\n                    &lt;div class=&quot;flex--item fl1 lh-lg&quot;&gt;\n                        &lt;b&gt;Closed&lt;/b&gt;. This question needs to be more &lt;a href=&quot;/help/closed-questions&quot;&gt;focused&lt;/a&gt;. It is not currently accepting answers.\n                        \n                    &lt;/div&gt;\n                &lt;/div&gt;\n            &lt;/div&gt;\n        &lt;/div&gt;\n            &lt;hr class=&quot;my12 outline-none baw0 bb bc-powder-400&quot;&gt;\n        &lt;div class=&quot;fw-nowrap fc-black-600&quot;&gt;\n            &lt;div class=&quot;d-flex fd-column lh-md&quot;&gt;\n                &lt;div class=&quot;mb0 d-flex&quot;&gt;\n                        &lt;div class=&quot;flex--item mr8&quot;&gt;\n                            &lt;svg aria-hidden=&quot;true&quot; class=&quot;svg-icon iconLightbulb&quot; width=&quot;18&quot; height=&quot;18&quot; viewBox=&quot;0 0 18 18&quot;&gt;&lt;path d=&quot;M15 6.38A6.48 6.48 0 0 0 7.78.04h-.02A6.49 6.49 0 0 0 2.05 5.6a6.31 6.31 0 0 0 2.39 5.75c.49.39.76.93.76 1.5v.24c0 1.07.89 1.9 1.92 1.9h2.75c1.04 0 1.92-.83 1.92-1.9v-.2c0-.6.26-1.15.7-1.48A6.32 6.32 0 0 0 15 6.37ZM4.03 5.85A4.49 4.49 0 0 1 8 2.02a4.48 4.48 0 0 1 5 4.36 4.3 4.3 0 0 1-1.72 3.44c-.98.74-1.5 1.9-1.5 3.08v.1H7.2v-.14c0-1.23-.6-2.34-1.53-3.07a4.32 4.32 0 0 1-1.64-3.94ZM10 18a1 1 0 0 0 0-2H7a1 1 0 1 0 0 2h3Z&quot;&gt;&lt;/path&gt;&lt;/svg&gt;\n                        &lt;/div&gt;\n                    &lt;p&gt;&lt;b&gt;Want to improve this question?&lt;/b&gt; Update the question so it focuses on one problem only by &lt;a href=&quot;/posts/926266/edit&quot;&gt;editing this post&lt;/a&gt;.&lt;/p&gt;\n                &lt;/div&gt;\n                    &lt;div class=&quot;mb0 mt6 d-flex&quot;&gt;\n                        &lt;p class=&quot;ml24 pl2&quot;&gt;Closed &lt;span title=&quot;2013-11-15 22:32:33Z&quot; class=&quot;relativetime&quot;&gt;8 years ago&lt;/span&gt;.&lt;/p&gt;\n                    &lt;/div&gt;\n                &lt;div class=&quot;ml24 pl2&quot;&gt;\n\n                &lt;/div&gt;\n            &lt;/div&gt;\n        &lt;/div&gt;\n            &lt;div class=&quot;mt24 d-flex gsx gs8&quot;&gt;\n                    &lt;a class=&quot;s-btn s-btn__outlined flex--item js-post-notice-edit-post&quot; href=&quot;/posts/926266/edit&quot;&gt;\n                        Improve this question\n                    &lt;/a&gt;\n            &lt;/div&gt;\n&lt;/aside&gt;\n\n    &lt;/div&gt;\n\n&lt;p&gt;There are plenty of performance questions on this site already, but it occurs to me that almost all are very problem-specific and fairly narrow. And almost all repeat the advice to avoid premature optimization.&lt;/p&gt;\n\n&lt;p&gt;Let&apos;s assume:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;the code already is working correctly&lt;/li&gt;\n&lt;li&gt;the algorithms chosen are already optimal for the circumstances of the problem&lt;/li&gt;\n&lt;li&gt;the code has been measured, and the offending routines have been isolated&lt;/li&gt;\n&lt;li&gt;all attempts to optimize will also be measured to ensure they do not make matters worse&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;What I am looking for here is strategies and tricks to squeeze out up to the last few percent in a critical algorithm when there is nothing else left to do but whatever it takes.&lt;/p&gt;\n\n&lt;p&gt;Ideally, try to make answers language agnostic, and indicate any down-sides to the suggested strategies where applicable.&lt;/p&gt;\n\n&lt;p&gt;I&apos;ll add a reply with my own initial suggestions, and look forward to whatever else the Stack Overflow community can think of.&lt;/p&gt;\n    ","slug":"performance-optimization-strategies-of-last-resort-closed-1657388420614","postType":"QUESTION","createdAt":"2022-07-09T17:40:20.000Z","updatedAt":"2022-07-09T17:40:20.000Z","tags":[],"relatedQuestions":[]},"randomQuestions":[{"title":"The Definitive C++ Book Guide and List","slug":"the-definitive-c++-book-guide-and-list-1657384247395"},{"title":"Prefer composition over inheritance?","slug":"prefer-composition-over-inheritance-1657387399409"},{"title":"How to remove the space between inline/inline-block elements?","slug":"how-to-remove-the-space-between-inlineinline-block-elements-1657384532273"},{"title":"The Definitive C Book Guide and List","slug":"the-definitive-c-book-guide-and-list-1657384747653"},{"title":"Why is processing a sorted array faster than processing an unsorted array?","slug":"why-is-processing-a-sorted-array-faster-than-processing-an-unsorted-array-1657385497444"},{"title":"input() error - NameError: name '...' is not defined","slug":"input()-error-nameerror:-name-'...'-is-not-defined-1657388497243"},{"title":"Why does Tkinter image not show up if created in a function?","slug":"why-does-tkinter-image-not-show-up-if-created-in-a-function-1657387388233"},{"title":"Why are floating point numbers inaccurate?","slug":"why-are-floating-point-numbers-inaccurate-1657387346111"},{"title":"How can I iterate through two lists in parallel?","slug":"how-can-i-iterate-through-two-lists-in-parallel-1657387278930"},{"title":"Why does my recursive function return None?","slug":"why-does-my-recursive-function-return-none-1657387792894"},{"title":"Use a content script to access the page context variables and functions","slug":"use-a-content-script-to-access-the-page-context-variables-and-functions-1657384842444"},{"title":"Why does \"a == x or y or z\" always evaluate to True?","slug":"why-does-\"a-x-or-y-or-z\"-always-evaluate-to-true-1657384855216"},{"title":"How do I detect collision in pygame?","slug":"how-do-i-detect-collision-in-pygame-1657387496338"},{"title":"How to Sort a Multi-dimensional Array by Value","slug":"how-to-sort-a-multi-dimensional-array-by-value-1657387746110"},{"title":"How can I sort arrays and data in PHP?","slug":"how-can-i-sort-arrays-and-data-in-php-1657384726665"},{"title":"What is an efficient way to implement a singleton pattern in Java? [closed]","slug":"what-is-an-efficient-way-to-implement-a-singleton-pattern-in-java-closed-1657387970474"},{"title":"Make container shrink-to-fit child elements as they wrap","slug":"make-container-shrink-to-fit-child-elements-as-they-wrap-1657388134549"},{"title":"What is dependency injection?","slug":"what-is-dependency-injection-1657387953056"},{"title":"How do you access the matched groups in a JavaScript regular expression?","slug":"how-do-you-access-the-matched-groups-in-a-javascript-regular-expression-1657388233817"},{"title":"Is it possible to escape regex metacharacters reliably with sed","slug":"is-it-possible-to-escape-regex-metacharacters-reliably-with-sed-1657388428795"}]},"__N_SSG":true}