{"pageProps":{"data":{"answer":["\n&lt;p&gt;A debugger is a program that can examine the state of your program while your program is running. The &lt;a href=&quot;https://stackoverflow.com/questions/216819/how-does-a-debugger-work&quot;&gt;technical means it uses for doing this&lt;/a&gt; are not important for understanding the basics of how to use a debugger. You can use a debugger to halt the execution of your program when it reaches a particular place in your code, then examine the values of the variables in the program. You can use a debugger to run your program very slowly, one line of code at a time (called &lt;em&gt;single stepping&lt;/em&gt;), while you examine the values of its variables.&lt;/p&gt;\n\n&lt;h2&gt;Using a debugger is an expected basic skill&lt;/h2&gt;\n\n&lt;p&gt;A debugger is a very powerful tool for helping diagnose problems with programs.  And debuggers are available for all practical programming languages. Therefore being able to use a debugger is considered a &lt;strong&gt;basic skill&lt;/strong&gt; of any professional or enthusiast programmer. And using a debugger &lt;em&gt;yourself&lt;/em&gt;  is considered &lt;strong&gt;basic work&lt;/strong&gt; you should do &lt;em&gt;yourself&lt;/em&gt; before asking others for help. As this site is for professional and enthusiast programmers, and not a helpdesk or mentoring site, if you have a question about a problem with a specific program, but have not used a debugger, your question is very likely to be closed and downvoted. If you persist with questions like that, you will eventually be blocked from posting more. &lt;/p&gt;\n\n&lt;h2&gt;How a debugger can help you&lt;/h2&gt;\n\n&lt;p&gt;By using a debugger you can discover whether a variable has the wrong value, and where in your program its value changed to the wrong value.&lt;/p&gt;\n\n&lt;p&gt;Using single stepping you can also discover whether the control flow is as you expect. For example, whether an &lt;code&gt;if&lt;/code&gt; branch executed when you expect it ought to be.&lt;/p&gt;\n\n&lt;h2&gt;General notes on using a debugger&lt;/h2&gt;\n\n&lt;p&gt;The specifics of using a debugger depend on the debugger and, to a lesser degree, the programming language you are using.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;You can &lt;em&gt;attach&lt;/em&gt; a debugger to a process already running your program. You might do if your program is stuck.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In practice it is often easier to run your program under the control of a debugger from the very start.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You indicate &lt;em&gt;where&lt;/em&gt; your program should stop executing by indicating the source-code file and line number of the line at which execution should stop, or by indicating the name of the method/function at which the program should stop (if you want to stop as soon as execution enters the method). The technical means that the debugger uses to cause your program to stop is called a &lt;em&gt;breakpoint&lt;/em&gt; and this process is called &lt;em&gt;setting a breakpoint&lt;/em&gt;.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Most &lt;a href=&quot;https://stackoverflow.com/a/426586/545127&quot;&gt;modern debuggers are part of an IDE&lt;/a&gt; and provide you with a convenient GUI for examining the source code and variables of your program, with a point-and-click interface for setting breakpoints, running your program and single stepping it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Using a debugger can be very difficult unless your program executable or bytecode files include debugging &lt;em&gt;symbol information&lt;/em&gt; and cross-references to your source-code. You might have to &lt;a href=&quot;https://stackoverflow.com/questions/89603/how-does-the-debugging-option-g-change-the-binary-executable&quot;&gt;compile (or recompile) your program slightly differently&lt;/a&gt; to ensure that information is present. If the compiler performs extensive optimizations, those cross-references can become confusing. You might therefore have to &lt;a href=&quot;https://stackoverflow.com/a/7857696/545127&quot;&gt;recompile your program with optimizations turned off&lt;/a&gt;.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;I want to add that a debugger isn&apos;t always the perfect solution, and shouldn&apos;t always be the go-to solution to debugging. Here are a few cases where a debugger might not work for you:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;The part of your program which fails is really large (poor modularization, perhaps?) and you&apos;re not exactly sure where to start stepping through the code. Stepping through all of it might be too time-consuming.&lt;/li&gt;\n&lt;li&gt;Your program uses a lot of callbacks and other non-linear flow control methods, which makes the debugger confused when you step through it.&lt;/li&gt;\n&lt;li&gt;Your program is multi-threaded. Or even worse, your problem is caused by a race condition.&lt;/li&gt;\n&lt;li&gt;The code that has the bug in it runs many times before it bugs out. This can be particularly problematic in main loops, or worse yet, in physics engines, where the problem could be numerical. Even setting a breakpoint, in this case, would simply have you hitting it many times, with the bug not appearing.&lt;/li&gt;\n&lt;li&gt;Your program must run in real-time. This is a big issue for programs that connect to the network. If you set up a breakpoint in your network code, the other end isn&apos;t going to wait for you to step through, it&apos;s simply going to time out. Programs that rely on the system clock, e.g. games with frameskip, aren&apos;t much better off either.&lt;/li&gt;\n&lt;li&gt;Your program performs some form of destructive actions, like writing to files or sending e-mails, and you&apos;d like to limit the number of times you need to run through it.&lt;/li&gt;\n&lt;li&gt;You can tell that your bug is caused by incorrect values arriving at function X, but you don&apos;t know where these values come from. Having to run through the program, again and again, setting breakpoints farther and farther back, can be a huge hassle. Especially if function X is called from many places throughout the program.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In all of these cases, either having your program stop abruptly could cause the end results to differ, or stepping through manually in search of the one line where the bug is caused is too much of a hassle. This can equally happen whether your bug is incorrect behavior, or a crash. For instance, if memory corruption causes a crash, by the time the crash happens, it&apos;s too far from where the memory corruption first occurred, and no useful information is left.&lt;/p&gt;\n\n&lt;p&gt;So, what are the alternatives?&lt;/p&gt;\n\n&lt;p&gt;Simplest is simply logging and assertions. Add logs to your program at various points, and compare what you get with what you&apos;re expecting. For instance, see if the function where you think there&apos;s a bug is even called in the first place. See if the variables at the start of a method are what you think they are. Unlike breakpoints, it&apos;s okay for there to be many log lines in which nothing special happens. You can simply search through the log afterward. Once you hit a log line that&apos;s different from what you&apos;re expecting, add more in the same area. Narrow it down farther and farther, until it&apos;s small enough to be able to log every line in the bugged area.&lt;/p&gt;\n\n&lt;p&gt;Assertions can be used to trap incorrect values as they occur, rather than once they have an effect visible to the end-user. The quicker you catch an incorrect value, the closer you are to the line that produced it.&lt;/p&gt;\n\n&lt;p&gt;Refactor and unit test. If your program is too big, it might be worthwhile to test it one class or one function at a time. Give it inputs, and look at the outputs, and see which are not as you&apos;re expecting. Being able to narrow down a bug from an entire program to a single function can make a huge difference in debugging time.&lt;/p&gt;\n\n&lt;p&gt;In case of memory leaks or memory stomping, use appropriate tools that are able to analyze and detect these at runtime. Being able to detect where the actual corruption occurs is the first step. After this, you can use logs to work your way back to where incorrect values were introduced.&lt;/p&gt;\n\n&lt;p&gt;Remember that debugging is a process going backward. You have the end result - a bug - and find the cause, which preceded it. It&apos;s about working your way backward and, unfortunately, debuggers only step forwards. This is where good logging and postmortem analysis can give you much better results.&lt;/p&gt;\n    "],"id":67,"title":"What is a debugger and how can it help me diagnose problems?","content":"\n                \n&lt;p&gt;This is intended to be a general-purpose question to assist new programmers who have a problem with a program, but do not know how to use a debugger to diagnose the cause of the problem.&lt;/p&gt;\n&lt;p&gt;This question covers three classes of more specific question:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;When I run my program, it does not produce the output I expect for the input I gave it.&lt;/li&gt;\n&lt;li&gt;When I run my program, it crashes and gives me a stack trace. I have &lt;a href=&quot;https://stackoverflow.com/questions/3988788/what-is-a-stack-trace-and-how-can-i-use-it-to-debug-my-application-errors&quot;&gt;examined the stack trace&lt;/a&gt;, but I still do not know the cause of the problem because the stack trace does not provide me with enough information.&lt;/li&gt;\n&lt;li&gt;When I run my program, it crashes because of a segmentation fault (SEGV).&lt;/li&gt;\n&lt;/ul&gt;\n    ","slug":"what-is-a-debugger-and-how-can-it-help-me-diagnose-problems-1657384472469","postType":"QUESTION","createdAt":"2022-07-09T16:34:32.000Z","updatedAt":"2022-07-09T16:34:32.000Z","tags":[],"relatedQuestions":[]},"randomQuestions":[{"title":"Is List<Dog> a subclass of List<Animal>? Why are Java generics not implicitly polymorphic?","slug":"is-listlessdoggreater-a-subclass-of-listlessanimalgreater-why-are-java-generics-not-implicitly-polymorphic-1657384766724"},{"title":"How do I generate random integers within a specific range in Java?","slug":"how-do-i-generate-random-integers-within-a-specific-range-in-java-1657385458888"},{"title":"How can I combine two strings together in PHP?","slug":"how-can-i-combine-two-strings-together-in-php-1657388279401"},{"title":"What are good ways to prevent SQL injection? [duplicate]","slug":"what-are-good-ways-to-prevent-sql-injection-duplicate-1657388431570"},{"title":"RegEx match open tags except XHTML self-contained tags","slug":"regex-match-open-tags-except-xhtml-self-contained-tags-1657384228245"},{"title":"Scroll to an element with jQuery","slug":"scroll-to-an-element-with-jquery-1657388523178"},{"title":"What Is Selenium And What Is WebDriver?","slug":"what-is-selenium-and-what-is-webdriver-1657385470372"},{"title":"srand() — why call it only once?","slug":"srand()-why-call-it-only-once-1657387794760"},{"title":"Performance optimization strategies of last resort [closed]","slug":"performance-optimization-strategies-of-last-resort-closed-1657388420614"},{"title":"Why can templates only be implemented in the header file?","slug":"why-can-templates-only-be-implemented-in-the-header-file-1657384341933"},{"title":"Split array into chunks","slug":"split-array-into-chunks-1657387896420"},{"title":"Javascript infamous Loop issue? [duplicate]","slug":"javascript-infamous-loop-issue-duplicate-1657387498530"},{"title":"How can I access and process nested objects, arrays, or JSON?","slug":"how-can-i-access-and-process-nested-objects-arrays-or-json-1657384332823"},{"title":"What is the difference between a deep copy and a shallow copy?","slug":"what-is-the-difference-between-a-deep-copy-and-a-shallow-copy-1657388445063"},{"title":"How can I transition height: 0; to height: auto; using CSS?","slug":"how-can-i-transition-height:-0-to-height:-auto-using-css-1657388022100"},{"title":"Methods in ES6 objects: using arrow functions","slug":"methods-in-es6-objects:-using-arrow-functions-1657388249058"},{"title":"XMLHttpRequest cannot load XXX No 'Access-Control-Allow-Origin' header","slug":"xmlhttprequest-cannot-load-xxx-no-'access-control-allow-origin'-header-1657384758362"},{"title":"Servlet returns \"HTTP Status 404 The requested resource (/servlet) is not available\"","slug":"servlet-returns-\"http-status-404-the-requested-resource-(servlet)-is-not-available\"-1657384850661"},{"title":"What does \"list comprehension\" and similar mean? How does it work and how can I use it?","slug":"what-does-\"list-comprehension\"-and-similar-mean-how-does-it-work-and-how-can-i-use-it-1657387996940"},{"title":"JavaScript closure inside loops – simple practical example","slug":"javascript-closure-inside-loops-simple-practical-example-1657384278449"}]},"__N_SSG":true}