{"pageProps":{"data":{"answer":["\n&lt;p&gt;tl;dr &amp;nbsp;There&apos;s a summary at the end and headings in the answer to make it easier to find the relevant parts. Reading everything is recommended though as it provides useful background for understanding the &lt;strong&gt;why&lt;/strong&gt; that makes seeing how the &lt;strong&gt;how&lt;/strong&gt; applies in different circumstances easier.&lt;/p&gt;\n&lt;h1&gt;About the Same Origin Policy&lt;/h1&gt;\n&lt;p&gt;This is the &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/Security/Same-origin_policy&quot; rel=&quot;nofollow noreferrer&quot;&gt;Same Origin Policy&lt;/a&gt;. It is a security feature implemented by browsers.&lt;/p&gt;\n&lt;p&gt;Your particular case is showing how it is implemented for XMLHttpRequest (and you&apos;ll get identical results if you were to use fetch), but it also applies to other things (such as images loaded onto a &lt;code&gt;&amp;lt;canvas&amp;gt;&lt;/code&gt; or documents loaded into an &lt;code&gt;&amp;lt;iframe&amp;gt;&lt;/code&gt;), just with slightly different implementations.&lt;/p&gt;\n&lt;p&gt;(Weirdly, it also applies to CSS fonts, but that is because found foundries insisted on DRM and not for the security issues that the Same Origin Policy usually covers).&lt;/p&gt;\n&lt;p&gt;The standard scenario that demonstrates the need for the SOP can be demonstrated with &lt;a href=&quot;https://en.wikipedia.org/wiki/Alice_and_Bob&quot; rel=&quot;nofollow noreferrer&quot;&gt;three characters&lt;/a&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Alice is a person with a web browser&lt;/li&gt;\n&lt;li&gt;Bob runs a website (&lt;code&gt;https://www.[website].com/&lt;/code&gt; in your example)&lt;/li&gt;\n&lt;li&gt;Mallory runs a website (&lt;code&gt;http://localhost:4300&lt;/code&gt; in your example)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Alice is logged into Bob&apos;s site and has some confidential data there. Perhaps it is a company intranet (accessible only to browsers on the LAN), or her online banking (accessible only with a cookie you get after entering a username and password).&lt;/p&gt;\n&lt;p&gt;Alice visits Mallory&apos;s website which has some JavaScript that causes Alice&apos;s browser to make an HTTP request to Bob&apos;s website (from her IP address with her cookies, etc). This could be as simple as using &lt;code&gt;XMLHttpRequest&lt;/code&gt; and reading the &lt;code&gt;responseText&lt;/code&gt;.&lt;/p&gt;\n&lt;p&gt;The browser&apos;s Same Origin Policy prevents that JavaScript from reading the data returned by Bob&apos;s website (which Bob and Alice don&apos;t want Mallory to access). (Note that you can, for example, display an image using an &lt;code&gt;&amp;lt;img&amp;gt;&lt;/code&gt; element across origins because the content of the image is not exposed to JavaScript (or Mallory)  unless you throw canvas into the mix in which case you &lt;em&gt;will&lt;/em&gt; generate a same-origin violation error).&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Why the Same Origin Policy applies when you don&apos;t think it should&lt;/h1&gt;\n&lt;p&gt;For any given URL it is possible that the SOP is not needed. A couple of common scenarios where this is the case are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Alice, Bob and Mallory are the same person.&lt;/li&gt;\n&lt;li&gt;Bob is providing entirely public information&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; but the browser has no way of knowing if either of the above are true, so trust is not automatic and the SOP is applied. Permission has to be granted explicitly before the browser will give the data it was given to a different website.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Why the Same Origin Policy only applies to JavaScript in a web page&lt;/h1&gt;\n&lt;p&gt;Browser extensions&lt;code&gt;*&lt;/code&gt;, the Network tab in browser developer tools and applications like Postman are installed software. They aren&apos;t passing data from one website to the JavaScript belonging to a different website &lt;em&gt;just because you visited that different website&lt;/em&gt;. Installing software usually takes a more conscious choice.&lt;/p&gt;\n&lt;p&gt;There isn&apos;t a third party (Mallory) who is considered a risk.&lt;/p&gt;\n&lt;p&gt;&lt;code&gt;*&lt;/code&gt; Browser extensions do need to be written carefully to avoid cross-origin issues. &lt;a href=&quot;https://www.chromium.org/Home/chromium-security/extension-content-script-fetches&quot; rel=&quot;nofollow noreferrer&quot;&gt;See the Chrome documentation for example&lt;/a&gt;.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Why you can display data in the page without reading it with JS&lt;/h1&gt;\n&lt;p&gt;There are a number of circumstances where Mallory&apos;s site can cause a browser to fetch data from a third party and display it (e.g. by adding an &lt;code&gt;&amp;lt;img&amp;gt;&lt;/code&gt; element to display an image). It isn&apos;t possible for Mallory&apos;s JavaScript to read the data in that resource though, only Alice&apos;s browser and Bob&apos;s server can do that, so it is still secure.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;CORS&lt;/h1&gt;\n&lt;p&gt;The &lt;code&gt;Access-Control-Allow-Origin&lt;/code&gt; HTTP &lt;strong&gt;response&lt;/strong&gt; header referred to in the error message is part of the &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS&quot; rel=&quot;nofollow noreferrer&quot;&gt;CORS&lt;/a&gt; standard which allows Bob to explicitly grant permission to Mallory&apos;s site to access the data via Alice&apos;s browser.&lt;/p&gt;\n&lt;p&gt;A basic implementation would just include:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;&lt;span class=&quot;hljs-title class_&quot;&gt;Access&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Control&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Allow&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Origin&lt;/span&gt;: *\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt; in the response headers to permit any website to read the data.&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;&lt;span class=&quot;hljs-title class_&quot;&gt;Access&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Control&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Allow&lt;/span&gt;-&lt;span class=&quot;hljs-title class_&quot;&gt;Origin&lt;/span&gt;: &lt;span class=&quot;hljs-attr&quot;&gt;http&lt;/span&gt;:&lt;span class=&quot;hljs-comment&quot;&gt;//example.com&lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt; would allow only a specific site to access it, and Bob can dynamically generate that based on the &lt;code&gt;Origin&lt;/code&gt; &lt;em&gt;request&lt;/em&gt; header to permit multiple, but not all, sites to access it.&lt;/p&gt;\n&lt;p&gt;The specifics of how Bob sets that response header depend on Bob&apos;s HTTP server and/or server-side programming language. Users of Node.js/Express.js should use the &lt;a href=&quot;https://www.npmjs.com/package/cors&quot; rel=&quot;nofollow noreferrer&quot;&gt;well-documented CORS middleware&lt;/a&gt;. Users of other platforms should take a look at this &lt;a href=&quot;https://enable-cors.org/server.html&quot; rel=&quot;nofollow noreferrer&quot;&gt; collection of guides for various common configurations&lt;/a&gt; that might help.&lt;/p&gt;\n&lt;p&gt;&lt;a href=&quot;https://i.stack.imgur.com/VXM0t.png&quot; rel=&quot;nofollow noreferrer&quot;&gt;&lt;img src=&quot;https://i.stack.imgur.com/VXM0t.png&quot; alt=&quot;Model of where CORS rules are applied&quot;&gt;&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;NB: Some requests are complex and send a &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests&quot; rel=&quot;nofollow noreferrer&quot;&gt;preflight&lt;/a&gt; OPTIONS request that the server will have to respond to before the browser will send the GET/POST/PUT/Whatever request that the JS wants to make. Implementations of CORS that only add &lt;code&gt;Access-Control-Allow-Origin&lt;/code&gt; to specific URLs often get tripped up by this.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;Obviously granting permission via CORS is something Bob would only do only if either:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The data was not private &lt;em&gt;or&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;Mallory was trusted&lt;/li&gt;\n&lt;/ul&gt;\n&lt;hr&gt;\n&lt;h2&gt;How do I add these headers?&lt;/h2&gt;\n&lt;p&gt;It depends on your server-side environment.&lt;/p&gt;\n&lt;p&gt;If you can, use a library designed to handle CORS as they will present you with simple options instead of having to deal with everything manually.&lt;/p&gt;\n&lt;p&gt;&lt;a href=&quot;https://enable-cors.org/server.html&quot; rel=&quot;nofollow noreferrer&quot;&gt;Enable-Cors.org&lt;/a&gt; has a list of documentation for specific platforms and frameworks that you might find useful.&lt;/p&gt;\n&lt;h2&gt;But I&apos;m not Bob!&lt;/h2&gt;\n&lt;p&gt;There is no standard mechanism for &lt;em&gt;Mallory&lt;/em&gt; to add this header because it has to come from Bob&apos;s website, which she does not control.&lt;/p&gt;\n&lt;p&gt;If Bob is running a public API then there might be a mechanism to turn on CORS (perhaps by formatting the request in a certain way, or a config option after logging into a Developer Portal site for Bob&apos;s site). This will have to be a mechanism implemented by Bob though. Mallory could read the documentation on Bob&apos;s site to see if something is available, or she could talk to Bob and ask him to implement CORS.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Error messages which mention &quot;Response for preflight&quot;&lt;/h1&gt;\n&lt;p&gt;Some cross origin requests are &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/HTTP/Access_control_CORS#Preflighted_requests&quot; rel=&quot;nofollow noreferrer&quot;&gt;preflighted&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;This happens when (roughly speaking) you try to make a cross-origin request that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Includes credentials like cookies&lt;/li&gt;\n&lt;li&gt;Couldn&apos;t be generated with a regular HTML form (e.g. has custom headers or a Content-Type that you couldn&apos;t use in a form&apos;s &lt;code&gt;enctype&lt;/code&gt;).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;If you are correctly doing something that needs a preflight&lt;/h2&gt;\n&lt;p&gt;In these cases then &lt;strong&gt;the rest of this answer still applies&lt;/strong&gt; but you also need to make sure that the server can listen for the preflight request (which will be &lt;code&gt;OPTIONS&lt;/code&gt; (and not &lt;code&gt;GET&lt;/code&gt;, &lt;code&gt;POST&lt;/code&gt; or whatever you were trying to send) and respond to it with the right &lt;code&gt;Access-Control-Allow-Origin&lt;/code&gt; header but also &lt;code&gt;Access-Control-Allow-Methods&lt;/code&gt; and &lt;code&gt;Access-Control-Allow-Headers&lt;/code&gt; to allow your specific HTTP methods or headers.&lt;/p&gt;\n&lt;h2&gt;If you are triggering a preflight by mistake&lt;/h2&gt;\n&lt;p&gt;Sometimes people make mistakes when trying to construct Ajax requests, and sometimes these trigger the need for a preflight. If the API is designed to allow cross-origin requests, but doesn&apos;t require anything that would need a preflight, then this can break access.&lt;/p&gt;\n&lt;p&gt;Common mistakes that trigger this include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;trying to put &lt;code&gt;Access-Control-Allow-Origin&lt;/code&gt; and other CORS response headers on the request. These don&apos;t belong on the request, don&apos;t do anything helpful (what would be the point of a permissions system where you could grant yourself permission?), and must appear only on the response.&lt;/li&gt;\n&lt;li&gt;trying to put a &lt;code&gt;Content-Type: application/json&lt;/code&gt; header on a GET request that has no request body to describe the content of (typically when the author confuses &lt;code&gt;Content-Type&lt;/code&gt; and &lt;code&gt;Accept&lt;/code&gt;).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In either of these cases, removing the extra request header will often be enough to avoid the need for a preflight (which will solve the problem when communicating with APIs that support simple requests but not preflighted requests).&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Opaque responses (&lt;code&gt;no-cors&lt;/code&gt; mode)&lt;/h1&gt;\n&lt;p&gt;Sometimes you need to make an HTTP request, but you don&apos;t need to read the response. e.g. if you are posting a log message to the server for recording.&lt;/p&gt;\n&lt;p&gt;If you are using &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API/Using_Fetch&quot; rel=&quot;nofollow noreferrer&quot;&gt;the &lt;code&gt;fetch&lt;/code&gt; API&lt;/a&gt; (rather than &lt;code&gt;XMLHttpRequest&lt;/code&gt;), then you can configure it to not try to use CORS.&lt;/p&gt;\n&lt;p&gt;Note that &lt;strong&gt;this won&apos;t let you do anything that you require CORS to do&lt;/strong&gt;. &lt;strong&gt;You will not be able to read the response&lt;/strong&gt;. You will not be able to make a request that requires a preflight.&lt;/p&gt;\n&lt;p&gt;It will let you make a simple request, not see the response, and not fill the Developer Console with error messages.&lt;/p&gt;\n&lt;p&gt;How to do it is explained by the Chrome error message given when you make a request using &lt;code&gt;fetch&lt;/code&gt; and don&apos;t get permission to view the response with CORS:&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;Access to fetch at &apos;&lt;code&gt;https://example.com/&lt;/code&gt;&apos; from origin &apos;&lt;code&gt;https://example.net&lt;/code&gt;&apos; has been blocked by CORS policy: No &apos;&lt;code&gt;Access-Control-Allow-Origin&lt;/code&gt;&apos; header is present on the requested resource. If an opaque response serves your needs, set the request&apos;s mode to &apos;no-cors&apos; to fetch the resource with CORS disabled.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;Thus:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;&lt;span class=&quot;hljs-title function_&quot;&gt;fetch&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&quot;http://example.com&quot;&lt;/span&gt;, { &lt;span class=&quot;hljs-attr&quot;&gt;mode&lt;/span&gt;: &lt;span class=&quot;hljs-string&quot;&gt;&quot;no-cors&quot;&lt;/span&gt; });\n&lt;/code&gt;&lt;/pre&gt;\n&lt;hr&gt;\n&lt;h1&gt;Alternatives to CORS&lt;/h1&gt;\n&lt;h2&gt;JSONP&lt;/h2&gt;\n&lt;p&gt;Bob could also provide the data using a hack like &lt;a href=&quot;https://stackoverflow.com/questions/2067472/what-is-jsonp-all-about&quot;&gt;JSONP&lt;/a&gt; which is how people did cross-origin Ajax before CORS came along.&lt;/p&gt;\n&lt;p&gt;It works by presenting the data in the form of a JavaScript program which injects the data into Mallory&apos;s page.&lt;/p&gt;\n&lt;p&gt;It requires that Mallory trust Bob not to provide malicious code.&lt;/p&gt;\n&lt;p&gt;Note the common theme: The site providing the data has to tell the browser that it is OK for a third party site to access the data it is sending to the browser.&lt;/p&gt;\n&lt;p&gt;Since JSONP works by appending a &lt;code&gt;&amp;lt;script&amp;gt;&lt;/code&gt; element to load the data in the form of a JavaScript program which calls a function already in the page, attempting to use the JSONP technique on a URL which returns JSON will fail  typically with a CORB error  because JSON is not JavaScript.&lt;/p&gt;\n&lt;h2&gt;Move the two resources to a single Origin&lt;/h2&gt;\n&lt;p&gt;If the HTML document the JS runs in and the URL being requested are on the same origin (sharing the same scheme, hostname, and port) then they Same Origin Policy grants permission by default. CORS is not needed.&lt;/p&gt;\n&lt;h2&gt;A Proxy&lt;/h2&gt;\n&lt;p&gt;Mallory &lt;em&gt;could&lt;/em&gt; use server-side code to fetch the data (which she could then pass from her server to Alice&apos;s browser through HTTP as usual).&lt;/p&gt;\n&lt;p&gt;It will either:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;add CORS headers&lt;/li&gt;\n&lt;li&gt;convert the response to JSONP&lt;/li&gt;\n&lt;li&gt;exist on the same origin as the HTML document&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;That server-side code could be written &amp;amp; hosted by a third party (such as CORS Anywhere). Note the privacy implications of this: The third party can monitor who proxies what across their servers.&lt;/p&gt;\n&lt;p&gt;Bob wouldn&apos;t need to grant any permissions for that to happen.&lt;/p&gt;\n&lt;p&gt;There are no security implications here since that is just between Mallory and Bob. There is no way for Bob to think that Mallory is Alice and to provide Mallory with data that should be kept confidential between Alice and Bob.&lt;/p&gt;\n&lt;p&gt;Consequently, Mallory can only use this technique to read &lt;em&gt;public&lt;/em&gt; data.&lt;/p&gt;\n&lt;p&gt;Do note, however, that taking content from someone else&apos;s website and displaying it on your own might be a violation of &lt;em&gt;copyright&lt;/em&gt; and open you up to legal action.&lt;/p&gt;\n&lt;h2&gt;Writing something other than a web app&lt;/h2&gt;\n&lt;p&gt;As noted in the section &quot;Why the Same Origin Policy only applies to JavaScript in a web page&quot;, you can avoid the SOP by not writing JavaScript in a webpage.&lt;/p&gt;\n&lt;p&gt;That doesn&apos;t mean you can&apos;t continue to use JavaScript and HTML, but you could distribute it using some other mechanism, such as Node-WebKit or PhoneGap.&lt;/p&gt;\n&lt;h1&gt;Browser extensions&lt;/h1&gt;\n&lt;p&gt;It is possible for a browser extension to inject the CORS headers in the response before the Same Origin Policy is applied.&lt;/p&gt;\n&lt;p&gt;These can be useful for development, but are not practical for a production site (asking every user of your site to install a browser extension that disables a security feature of their browser is unreasonable).&lt;/p&gt;\n&lt;p&gt;They also tend to work only with simple requests (failing when handling preflight OPTIONS requests).&lt;/p&gt;\n&lt;p&gt;Having a proper development environment with a local development &lt;em&gt;server&lt;/em&gt;\nis usually a better approach.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Other security risks&lt;/h1&gt;\n&lt;p&gt;Note that SOP / CORS do not mitigate &lt;a href=&quot;https://en.wikipedia.org/wiki/Cross-site_scripting&quot; rel=&quot;nofollow noreferrer&quot;&gt;XSS&lt;/a&gt;, &lt;a href=&quot;https://en.wikipedia.org/wiki/Cross-site_request_forgery&quot; rel=&quot;nofollow noreferrer&quot;&gt;CSRF&lt;/a&gt;, or &lt;a href=&quot;https://en.wikipedia.org/wiki/SQL_injection&quot; rel=&quot;nofollow noreferrer&quot;&gt;SQL Injection&lt;/a&gt; attacks which need to be handled independently.&lt;/p&gt;\n&lt;hr&gt;\n&lt;h1&gt;Summary&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;There is nothing you can do in &lt;em&gt;your&lt;/em&gt; client-side code that will enable CORS access to someone &lt;em&gt;else&apos;s&lt;/em&gt; server.&lt;/li&gt;\n&lt;li&gt;If you control the server the request is being made to: Add CORS permissions to it.&lt;/li&gt;\n&lt;li&gt;If you are friendly with the person who controls it: Get them to add CORS permissions to it.&lt;/li&gt;\n&lt;li&gt;If it is a public service:\n&lt;ul&gt;\n&lt;li&gt;Read their API documentation to see what they say about accessing it with client-side JavaScript:\n&lt;ul&gt;\n&lt;li&gt;They might tell you to use specific URLs&lt;/li&gt;\n&lt;li&gt;They might support JSONP&lt;/li&gt;\n&lt;li&gt;They might not support cross-origin access from client-side code at all (this might be a deliberate decision on security grounds, especially if you have to pass a personalised API Key in each request).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Make sure you aren&apos;t triggering a preflight request you don&apos;t need. The API might grant permission for simple requests but not preflighted requests.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;If none of the above apply: Get the browser to talk to &lt;em&gt;your&lt;/em&gt; server instead, and then have your server fetch the data from the other server and pass it on. (There are also third-party hosted services which attach CORS headers to publically accessible resources that you could use).&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Target server must allowed cross-origin request. In order to allow it through express, simply handle http options request :&lt;/p&gt;\n\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;app.&lt;span class=&quot;hljs-title function_&quot;&gt;options&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&apos;/url...&apos;&lt;/span&gt;, &lt;span class=&quot;hljs-keyword&quot;&gt;function&lt;/span&gt;(&lt;span class=&quot;hljs-params&quot;&gt;req, res, next&lt;/span&gt;){\n   res.&lt;span class=&quot;hljs-title function_&quot;&gt;header&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&apos;Access-Control-Allow-Origin&apos;&lt;/span&gt;, &lt;span class=&quot;hljs-string&quot;&gt;&quot;*&quot;&lt;/span&gt;);\n   res.&lt;span class=&quot;hljs-title function_&quot;&gt;header&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&apos;Access-Control-Allow-Methods&apos;&lt;/span&gt;, &lt;span class=&quot;hljs-string&quot;&gt;&apos;POST&apos;&lt;/span&gt;);\n   res.&lt;span class=&quot;hljs-title function_&quot;&gt;header&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&quot;Access-Control-Allow-Headers&quot;&lt;/span&gt;, &lt;span class=&quot;hljs-string&quot;&gt;&quot;accept, content-type&quot;&lt;/span&gt;);\n   res.&lt;span class=&quot;hljs-title function_&quot;&gt;header&lt;/span&gt;(&lt;span class=&quot;hljs-string&quot;&gt;&quot;Access-Control-Max-Age&quot;&lt;/span&gt;, &lt;span class=&quot;hljs-string&quot;&gt;&quot;1728000&quot;&lt;/span&gt;);\n   &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; res.&lt;span class=&quot;hljs-title function_&quot;&gt;sendStatus&lt;/span&gt;(&lt;span class=&quot;hljs-number&quot;&gt;200&lt;/span&gt;);\n});\n&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;As this isn&apos;t mentioned in the accepted answer.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;This is not the case for this exact question, but might help others that search for that problem&lt;/li&gt;\n&lt;li&gt;This is something you can do in your client-code to prevent CORS errors in &lt;em&gt;some cases&lt;/em&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;You can make use of &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests&quot; rel=&quot;nofollow noreferrer&quot;&gt;Simple Requests&lt;/a&gt;.&lt;br&gt;\nIn order to perform a &apos;Simple Requests&apos; the request needs to meet several conditions. E.g. only allowing &lt;code&gt;POST&lt;/code&gt;, &lt;code&gt;GET&lt;/code&gt; and &lt;code&gt;HEAD&lt;/code&gt; method, as well as only allowing some given Headers (you can find all conditions &lt;a href=&quot;https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS#Simple_requests&quot; rel=&quot;nofollow noreferrer&quot;&gt;here&lt;/a&gt;).&lt;/p&gt;\n\n&lt;p&gt;If your client code does not explicit set affected Headers (e.g. &quot;Accept&quot;) with a fix value in the request it &lt;em&gt;might&lt;/em&gt; occur that some clients do set these Headers automatically with some &quot;non-standard&quot; values causing the server to not accept it as Simple Request - which will give you a CORS error.&lt;/p&gt;\n    ","\n&lt;p&gt;This is happening because of the CORS error. CORS stands for Cross Origin Resource Sharing. In simple words, this error occurs when we try to access a domain/resource from another domain. &lt;/p&gt;\n\n&lt;p&gt;Read More about it here: &lt;a href=&quot;https://stackoverflow.com/questions/25923796/cors-error-with-jquery&quot;&gt;CORS error with jquery&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;To fix this, if you have access to the other domain, you will have to allow Access-Control-Allow-Origin in the server. This can be added in the headers. You can enable this for all the requests/domains or a specific domain.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=&quot;https://stackoverflow.com/questions/5750696/how-to-get-a-cross-origin-resource-sharing-cors-post-request-working&quot;&gt;How to get a cross-origin resource sharing (CORS) post request working&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;These links may help&lt;/p&gt;\n    ","\n&lt;p&gt;This CORS issue wasn&apos;t further elaborated (for other causes).&lt;/p&gt;\n\n&lt;p&gt;I&apos;m having this issue currently under different reason.\nMy front end is returning &apos;Access-Control-Allow-Origin&apos; header error as well.&lt;/p&gt;\n\n&lt;p&gt;Just that I&apos;ve pointed the wrong URL so this header wasn&apos;t reflected properly (in which i kept presume it did). localhost (front end) -&amp;gt; call to non secured http (supposed to be https), make sure the API end point from front end is pointing to the correct protocol.&lt;/p&gt;\n    ","\n&lt;p&gt;I got the same error in Chrome console.&lt;/p&gt;\n\n&lt;p&gt;My problem was, I was trying to go to the site using &lt;code&gt;http://&lt;/code&gt; instead of &lt;code&gt;https://&lt;/code&gt;. So there was nothing to fix, just had to go to the same site using &lt;code&gt;https&lt;/code&gt;.&lt;/p&gt;\n    ","\n&lt;p&gt;&quot;Get&quot; request with appending headers transform to &quot;Options&quot; request. So Cors policy problems occur. You have to implement &quot;Options&quot; request to your server.&lt;/p&gt;\n    ","\n&lt;p&gt;This bug cost me 2 days. I checked my Server log, the Preflight Option request/response between browser Chrome/Edge and Server was ok. The main reason is that GET/POST/PUT/DELETE &lt;strong&gt;server response&lt;/strong&gt; for XHTMLRequest must also have the following header:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;access-control-allow-&lt;span class=&quot;hljs-attr&quot;&gt;origin&lt;/span&gt;: origin  \n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;&quot;origin&quot; is in the &lt;strong&gt;request header&lt;/strong&gt; (Browser will add it to request for you). for example:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;&lt;span class=&quot;hljs-title class_&quot;&gt;Origin&lt;/span&gt;: &lt;span class=&quot;hljs-attr&quot;&gt;http&lt;/span&gt;:&lt;span class=&quot;hljs-comment&quot;&gt;//localhost:4221&lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;you can add response header like the following to accept for all:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;access-control-allow-&lt;span class=&quot;hljs-attr&quot;&gt;origin&lt;/span&gt;: *  \n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;or response header for a specific request like:&lt;/p&gt;\n&lt;pre class=&quot;lang-js s-code-block&quot;&gt;&lt;code class=&quot;hljs language-javascript&quot;&gt;access-control-allow-&lt;span class=&quot;hljs-attr&quot;&gt;origin&lt;/span&gt;: &lt;span class=&quot;hljs-attr&quot;&gt;http&lt;/span&gt;:&lt;span class=&quot;hljs-comment&quot;&gt;//localhost:4221 &lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;The message in browsers is not clear to understand: &lt;strong&gt;&quot;...The requested resource&quot;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;note that:&lt;/strong&gt;\nCORS works well for localhost. different port means different Domain.\nif you get error message, check the CORS config on the server side.&lt;/p&gt;\n    ","\n&lt;p&gt;In most housing services just add in the .htaccess on the target server folder this:&lt;/p&gt;\n&lt;p&gt;Header set Access-Control-Allow-Origin &apos;https://your.site.folder&apos;&lt;/p&gt;\n    ","\n&lt;p&gt;I had the same issue. In my case i fixed it by adding addition parameter of &lt;code&gt;timestamp&lt;/code&gt; to my URL. Even this was not required by the server I was accessing.&lt;/p&gt;\n&lt;p&gt;Example yoururl.com/yourdocument?timestamp=1234567&lt;/p&gt;\n&lt;p&gt;Note: I used epos timestamp&lt;/p&gt;\n    ","\n&lt;p&gt;You should enable CORS to get it working.&lt;/p&gt;\n    "],"id":146,"title":"XMLHttpRequest cannot load XXX No 'Access-Control-Allow-Origin' header","content":"\n                \n&lt;h2&gt;tl;dr; About the Same Origin Policy&lt;/h2&gt;\n\n&lt;p&gt;I have a Grunt process which initiates an instance of express.js server. This was working absolutely fine up until just now when it started serving a blank page with the following appearing in the error log in the developer&apos;s console in Chrome (latest version):&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;XMLHttpRequest cannot load &lt;a href=&quot;https://www.example.com/&quot; rel=&quot;noreferrer&quot;&gt;https://www.example.com/&lt;/a&gt;\n      No &apos;Access-Control-Allow-Origin&apos; header is present on the requested \n      resource. Origin &apos;&lt;a href=&quot;http://localhost:4300&quot; rel=&quot;noreferrer&quot;&gt;http://localhost:4300&lt;/a&gt;&apos; is therefore not allowed access.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What is stopping me from accessing the page?&lt;/p&gt;\n    ","slug":"xmlhttprequest-cannot-load-xxx-no-'access-control-allow-origin'-header-1657384758362","postType":"QUESTION","createdAt":"2022-07-09T16:39:18.000Z","updatedAt":"2022-07-09T16:39:18.000Z","tags":[],"relatedQuestions":[]},"randomQuestions":[{"title":"Useless use of cat?","slug":"useless-use-of-cat-1657388390794"},{"title":"Identifying and solving javax.el.PropertyNotFoundException: Target Unreachable","slug":"identifying-and-solving-javax.el.propertynotfoundexception:-target-unreachable-1657388164753"},{"title":"What is PECS (Producer Extends Consumer Super)?","slug":"what-is-pecs-(producer-extends-consumer-super)-1657384828870"},{"title":"Generating random whole numbers in JavaScript in a specific range","slug":"generating-random-whole-numbers-in-javascript-in-a-specific-range-1657388112728"},{"title":"Javascript infamous Loop issue? [duplicate]","slug":"javascript-infamous-loop-issue-duplicate-1657387498530"},{"title":"Object comparison in JavaScript [duplicate]","slug":"object-comparison-in-javascript-duplicate-1657387675463"},{"title":"What is JSONP, and why was it created?","slug":"what-is-jsonp-and-why-was-it-created-1657387770563"},{"title":"How to format numbers as currency strings","slug":"how-to-format-numbers-as-currency-strings-1657388399166"},{"title":"\"Notice: Undefined variable\", \"Notice: Undefined index\", \"Warning: Undefined array key\", and \"Notice: Undefined offset\" using PHP","slug":"\"notice:-undefined-variable\"-\"notice:-undefined-index\"-\"warning:-undefined-array-key\"-and-\"notice:-undefined-offset\"-using-php-1657384250748"},{"title":"What are drawbacks or disadvantages of singleton pattern? [closed]","slug":"what-are-drawbacks-or-disadvantages-of-singleton-pattern-closed-1657387360749"},{"title":"What special characters must be escaped in regular expressions?","slug":"what-special-characters-must-be-escaped-in-regular-expressions-1657387465381"},{"title":"How do we control web page caching, across all browsers?","slug":"how-do-we-control-web-page-caching-across-all-browsers-1657387529059"},{"title":"Split array into chunks","slug":"split-array-into-chunks-1657387896420"},{"title":"Simulating group_concat MySQL function in Microsoft SQL Server 2005?","slug":"simulating-group_concat-mysql-function-in-microsoft-sql-server-2005-1657384832169"},{"title":"Can I mix MySQL APIs in PHP?","slug":"can-i-mix-mysql-apis-in-php-1657384597444"},{"title":"How can I convert ereg expressions to preg in PHP?","slug":"how-can-i-convert-ereg-expressions-to-preg-in-php-1657387652855"},{"title":"Why use getters and setters/accessors?","slug":"why-use-getters-and-settersaccessors-1657387343971"},{"title":"I just assigned a variable, but echo $variable shows something else","slug":"i-just-assigned-a-variable-but-echo-dollarvariable-shows-something-else-1657387574561"},{"title":"RegEx match open tags except XHTML self-contained tags","slug":"regex-match-open-tags-except-xhtml-self-contained-tags-1657384228245"},{"title":"How to affect other elements when one element is hovered","slug":"how-to-affect-other-elements-when-one-element-is-hovered-1657387832363"}]},"__N_SSG":true}