{"pageProps":{"data":{"count":1,"rows":[{"id":519,"title":"Why are global variables evil? [closed]","slug":"why-are-global-variables-evil-closed-1657388260006","postType":"QUESTION","createdAt":"2022-07-09T17:37:40.000Z","updatedAt":"2022-07-09T17:37:40.000Z","tags":[{"id":2566,"name":"side-effects","slug":"side-effects","createdAt":"2022-07-09T17:37:40.000Z","updatedAt":"2022-07-09T17:37:40.000Z","Questions_Tags":{"questionId":519,"tagId":2566}}]}]},"slug":"side-effects","page":1,"answers":{"519":["\n&lt;p&gt;This has nothing to do with Python; global variables are bad in any programming language.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;However, global constants&lt;/strong&gt; are not conceptually the same as &lt;strong&gt;global variables&lt;/strong&gt;; global constants are perfectly harmless. In Python the distinction between the two is purely by convention: &lt;code&gt;CONSTANTS_ARE_CAPITALIZED&lt;/code&gt; and &lt;code&gt;globals_are_not&lt;/code&gt;.&lt;/p&gt;\n\n&lt;p&gt;The reason global variables are bad is that they enable functions to have hidden (non-obvious, surprising, hard to detect, hard to diagnose) side effects, leading to an increase in complexity, potentially leading to &lt;a href=&quot;https://en.wikipedia.org/wiki/Spaghetti_code&quot; rel=&quot;noreferrer&quot;&gt;Spaghetti code&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;However, sane use of global state is acceptable (as is local state and mutability) even in functional programming, either for algorithm optimization, reduced complexity, caching and memoization, or the practicality of porting structures originating in a predominantly imperative codebase.&lt;/p&gt;\n\n&lt;p&gt;All in all, your question can be answered in many ways, so your best bet is to just google &quot;why are global variables bad&quot;. Some examples:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;http://c2.com/cgi/wiki?GlobalVariablesAreBad&quot; rel=&quot;noreferrer&quot;&gt;Global Variables Are Bad - Wiki Wiki Web&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=&quot;https://softwareengineering.stackexchange.com/questions/148108/why-is-global-state-so-evil&quot;&gt;Why is Global State so Evil? - Software Engineering Stack Exchange&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=&quot;https://stackoverflow.com/questions/484635/are-global-variables-bad&quot;&gt;Are global variables bad?&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;If you want to go deeper and find out why side effects are all about, and many other enlightening things, you should learn Functional Programming:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://en.wikipedia.org/wiki/Side_effect_(computer_science)&quot; rel=&quot;noreferrer&quot;&gt;Side effect (computer science) - Wikipedia&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=&quot;https://softwareengineering.stackexchange.com/questions/15269/why-are-side-effects-considered-evil-in-functional-programming&quot;&gt;Why are side-effects considered evil in functional programming? - Software Engineering Stack Exchange&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=&quot;https://en.wikipedia.org/wiki/Functional_programming&quot; rel=&quot;noreferrer&quot;&gt;Functional programming - Wikipedia&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Yes, &lt;em&gt;in theory&lt;/em&gt;, globals (and &quot;state&quot; in general) are evil. In practice, if you look into your python&apos;s packages directory you&apos;ll find that most modules there start with a bunch of global declarations. Obviously, people have no problem with them.&lt;/p&gt;\n\n&lt;p&gt;Specifically to python, globals&apos; visibility is limited to a module, therefore there are no &quot;true&quot; globals that affect the whole program - that makes them a way less harmful. Another point: there are no &lt;code&gt;const&lt;/code&gt;, so when you need a constant you have to use a global.&lt;/p&gt;\n\n&lt;p&gt;In my practice, if I happen to modify a global in a function, I always declare it with &lt;code&gt;global&lt;/code&gt;, even if there technically no need for that, as in:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-py s-code-block&quot;&gt;&lt;code class=&quot;hljs language-python&quot;&gt;cache = {}\n\n&lt;span class=&quot;hljs-keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;foo&lt;/span&gt;(&lt;span class=&quot;hljs-params&quot;&gt;args&lt;/span&gt;):\n    &lt;span class=&quot;hljs-keyword&quot;&gt;global&lt;/span&gt; cache\n\n    cache[args] = ...\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;This makes globals&apos; manipulations easier to track down.&lt;/p&gt;\n    ","\n&lt;p&gt;A personal opinion on the topic is that having global variables being used in a function logic means that some other code can alter the logic and the expected output of that function which will make debugging very hard (especially in big projects) and will make testing harder as well.&lt;/p&gt;\n\n&lt;p&gt;Furthermore, if you consider other people reading your code (open-source community, colleagues etc) they will have a hard time trying to understand where the global variable is being set, where has been changed and what to expect from this global variable as opposed to an isolated function that its functionality can be determined by reading the function definition itself.&lt;/p&gt;\n\n&lt;h2&gt;(Probably) Violating Pure Function definition&lt;/h2&gt;\n\n&lt;p&gt;I believe that a clean and (nearly) bug-free code should have functions that are as pure as possible (see &lt;a href=&quot;https://en.wikipedia.org/wiki/Pure_function&quot; rel=&quot;noreferrer&quot;&gt;pure functions&lt;/a&gt;). A pure function is the one that has the following conditions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The function &lt;strong&gt;always evaluates the same result value given the same argument value(s)&lt;/strong&gt;. The function result value cannot depend on any hidden information or state that may change while program execution proceeds or between different executions of the program, nor can it depend on any external input from I/O devices (usuallysee below).&lt;/li&gt;\n&lt;li&gt;Evaluation of the result &lt;strong&gt;does not cause any semantically observable side effect or output&lt;/strong&gt;, such as mutation of mutable objects or output to I/O devices.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Having global variables is violating at least one of the above if not both as an external code can probably cause unexpected results.&lt;/p&gt;\n\n&lt;p&gt;Another clear definition of pure functions: &quot;Pure function is a function that takes &lt;strong&gt;all of its inputs as explicit arguments&lt;/strong&gt; and produces &lt;strong&gt;all of its outputs as explicit results&lt;/strong&gt;.&quot; &lt;a href=&quot;http://www.cs.nott.ac.uk/~pszgmh/pih.html&quot; rel=&quot;noreferrer&quot;&gt;[1]&lt;/a&gt;. Having global variables violates the idea of pure functions since an input and maybe one of the outputs (the global variable) is not explicitly being given or returned.&lt;/p&gt;\n\n&lt;h2&gt;(Probably) Violating Unit testing F.I.R.S.T principle&lt;/h2&gt;\n\n&lt;p&gt;Further on that, if you consider unit-testing and the F.I.R.S.T principle (&lt;strong&gt;F&lt;/strong&gt;ast tests, &lt;strong&gt;I&lt;/strong&gt;ndependent tests, &lt;strong&gt;R&lt;/strong&gt;epeatable, &lt;strong&gt;S&lt;/strong&gt;elf-Validating and &lt;strong&gt;T&lt;/strong&gt;imely) will probably violate the Independent tests principle (which means that tests don&apos;t depend on each other). &lt;/p&gt;\n\n&lt;p&gt;Having a global variable (not always) but in most of the cases (at least of what I have seen so far) is to prepare and pass results to other functions. This violates this principle as well. If the global variable has been used in that way (i.e the global variable used in function X has to be set in a function Y first) it means that to unit test function X you have to run test/run function Y first.&lt;/p&gt;\n\n&lt;h2&gt;Globals as constants&lt;/h2&gt;\n\n&lt;p&gt;On the other hand and as other people have already mentioned, if the global variable is used as a &quot;constant&quot; variable can be slightly better since the language does not support constants. However, I always prefer working with classes and having the &quot;constants&quot; as a class member and not use a global variable at all. If you have a code that two different classes require to share a global variable then you probably need to refactor your solution and make your classes independent.  &lt;/p&gt;\n\n&lt;p&gt;I don&apos;t believe that globals shouldn&apos;t be used. But if they are used the authors should consider some principles (the ones mentioned above perhaps and other software engineering principles and good practices) for a cleaner and nearly bug-free code.&lt;/p&gt;\n    ","\n&lt;p&gt;They are essential, the screen being a good example. However, in a multithreaded environment or with many developers involved, in practice often the question arises: who did (erraneously) set or clear it? Depending on the architecture, analysis can be costly and be required often. While reading the global var can be ok, writing to it must be controlled, for example by a single thread or threadsafe class. Hence, global vars arise the fear of high development costs possible by the consequences for which themselves are considered evil. Therefore in general, it&apos;s good practice to keep the number of global vars low.&lt;/p&gt;\n    "]},"randomTags":[{"name":"reshape","slug":"reshape"},{"name":"interop","slug":"interop"},{"name":"xml","slug":"xml"},{"name":"javascript-objects","slug":"javascript-objects"},{"name":"comma-operator","slug":"comma-operator"},{"name":"cartesian-product","slug":"cartesian-product"},{"name":"restriction","slug":"restriction"},{"name":"overflow","slug":"overflow"},{"name":"access-modifiers","slug":"access-modifiers"},{"name":"jtable","slug":"jtable"},{"name":"nested","slug":"nested"},{"name":"pdo","slug":"pdo"},{"name":"multiline","slug":"multiline"},{"name":"regex-greedy","slug":"regex-greedy"},{"name":"variable-expansion","slug":"variable-expansion"},{"name":"boolean-expression","slug":"boolean-expression"},{"name":"clearfix","slug":"clearfix"},{"name":"sed","slug":"sed"},{"name":"subprocess","slug":"subprocess"},{"name":"client-side","slug":"client-side"}]},"__N_SSG":true}