{"pageProps":{"data":{"count":1,"rows":[{"id":229,"title":"Why use getters and setters/accessors?","slug":"why-use-getters-and-settersaccessors-1657387343971","postType":"QUESTION","createdAt":"2022-07-09T17:22:23.000Z","updatedAt":"2022-07-09T17:22:23.000Z","tags":[{"id":1547,"name":"setter","slug":"setter","createdAt":"2022-07-09T17:22:24.000Z","updatedAt":"2022-07-09T17:22:24.000Z","Questions_Tags":{"questionId":229,"tagId":1547}}]}]},"slug":"setter","page":"1","answers":{"229":["\n&lt;p&gt;&lt;strong&gt;There are actually &lt;em&gt;many good reasons&lt;/em&gt; to consider using accessors&lt;/strong&gt; rather than directly exposing fields of a class - beyond just the argument of encapsulation and making future changes easier. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Here are the some of the reasons I am aware of:&lt;/em&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Encapsulation of behavior associated with getting or setting the property - this allows additional functionality (like validation) to be added more easily later.&lt;/li&gt;\n&lt;li&gt;Hiding the internal representation of the property while exposing a property using an alternative representation.&lt;/li&gt;\n&lt;li&gt;Insulating your public interface from change - allowing the public interface to remain constant while the implementation changes without affecting existing consumers.&lt;/li&gt;\n&lt;li&gt;Controlling the lifetime and memory management (disposal) semantics of the property - particularly important in non-managed memory environments (like C++ or Objective-C).&lt;/li&gt;\n&lt;li&gt;Providing a debugging interception point for when a property changes at runtime - debugging when and where a property changed to a particular value can be quite difficult without this in some languages.&lt;/li&gt;\n&lt;li&gt;Improved interoperability with libraries that are designed to operate against property getter/setters - Mocking, Serialization, and WPF come to mind.&lt;/li&gt;\n&lt;li&gt;Allowing inheritors to change the semantics of how the property behaves and is exposed by overriding the getter/setter methods.&lt;/li&gt;\n&lt;li&gt;Allowing the getter/setter to be passed around as lambda expressions rather than values.&lt;/li&gt;\n&lt;li&gt;Getters and setters can allow different access levels - for example the get may be public, but the set could be protected.&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;Because 2 weeks (months, years) from now when you realize that your setter needs to do &lt;strong&gt;more&lt;/strong&gt; than just set the value, you&apos;ll also realize that the property has been used directly in 238 other classes :-)&lt;/p&gt;\n    ","\n&lt;p&gt;A public field is not worse than a getter/setter pair that does nothing except returning the field and assigning to it. First, it&apos;s clear that (in most languages) there is no functional difference. Any difference must be in other factors, like maintainability or readability.&lt;/p&gt;\n\n&lt;p&gt;An oft-mentioned advantage of getter/setter pairs, isn&apos;t. There&apos;s this claim that you can change the implementation and your clients don&apos;t have to be recompiled. Supposedly, setters let you add functionality like validation later on and your clients don&apos;t even need to know about it. However, adding validation to a setter is a change to its preconditions, &lt;strong&gt;a violation of the previous contract&lt;/strong&gt;, which was, quite simply, &quot;you can put anything in here, and you can get that same thing later from the getter&quot;.&lt;/p&gt;\n\n&lt;p&gt;So, now that you broke the contract, changing every file in the codebase is something you should want to do, not avoid. If you avoid it you&apos;re making the assumption that all the code assumed the contract for those methods was different.&lt;/p&gt;\n\n&lt;p&gt;If that should not have been the contract, then the interface was allowing clients to put the object in invalid states. &lt;em&gt;That&apos;s the exact opposite of encapsulation&lt;/em&gt; If that field could not really be set to anything from the start, why wasn&apos;t the validation there from the start?&lt;/p&gt;\n\n&lt;p&gt;This same argument applies to other supposed advantages of these pass-through getter/setter pairs: if you later decide to change the value being set, you&apos;re breaking the contract. If you override the default functionality in a derived class, in a way beyond a few harmless modifications (like logging or other non-observable behaviour), you&apos;re breaking the contract of the base class. That is a violation of the Liskov Substitutability Principle, which is seen as one of the tenets of OO.&lt;/p&gt;\n\n&lt;p&gt;If a class has these dumb getters and setters for every field, then it is a class that has no invariants whatsoever, &lt;em&gt;no contract&lt;/em&gt;. Is that really object-oriented design? If all the class has is those getters and setters, it&apos;s just a dumb data holder, and dumb data holders should look like dumb data holders:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-cpp s-code-block&quot;&gt;&lt;code class=&quot;hljs language-cpp&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Foo&lt;/span&gt; {\n&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt;:\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; DaysLeft;\n    &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; ContestantNumber;\n};\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Adding pass-through getter/setter pairs to such a class adds no value. Other classes should provide meaningful operations, not just operations that fields already provide. That&apos;s how you can define and maintain useful invariants.&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;&lt;strong&gt;Client&lt;/strong&gt;: &quot;What can I do with an object of this class?&quot;&lt;br&gt;\n  &lt;strong&gt;Designer&lt;/strong&gt;: &quot;You can read and write several variables.&quot;&lt;br&gt;\n  &lt;strong&gt;Client&lt;/strong&gt;: &quot;Oh... cool, I guess?&quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are reasons to use getters and setters, but if those reasons don&apos;t exist, making getter/setter pairs in the name of false encapsulation gods is not a good thing. Valid reasons to make getters or setters include the things often mentioned as the potential changes you can make later, like validation or different internal representations. Or maybe the value should be readable by clients but not writable (for example, reading the size of a dictionary), so a simple getter is a nice choice. But those reasons should be there when you make the choice, and not just as a potential thing you may want later. This is an instance of YAGNI (&lt;em&gt;You Ain&apos;t Gonna Need It&lt;/em&gt;).&lt;/p&gt;\n    ","\n&lt;p&gt;Lots of people talk about the advantages of getters and setters but I want to play devil&apos;s advocate. Right now I&apos;m debugging a very large program where the programmers decided to make everything getters and setters. That might seem nice, but its a reverse-engineering nightmare.&lt;/p&gt;\n\n&lt;p&gt;Say you&apos;re looking through hundreds of lines of code and you come across this:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;person.name = &lt;span class=&quot;hljs-string&quot;&gt;&quot;Joe&quot;&lt;/span&gt;;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;It&apos;s a beautifully simply piece of code until you realize its a setter. Now, you follow that setter and find that it also sets person.firstName, person.lastName, person.isHuman, person.hasReallyCommonFirstName, and calls person.update(), which sends a query out to the database, etc. Oh, that&apos;s where your memory leak was occurring.&lt;/p&gt;\n\n&lt;p&gt;Understanding a local piece of code at first glance is an important property of good readability that getters and setters tend to break. That is why I try to avoid them when I can, and minimize what they do when I use them.&lt;/p&gt;\n    ","\n&lt;p&gt;In a pure object-oriented world getters and setters is a &lt;strong&gt;terrible anti-pattern&lt;/strong&gt;. Read this article: &lt;a href=&quot;http://www.yegor256.com/2014/09/16/getters-and-setters-are-evil.html&quot; rel=&quot;noreferrer&quot;&gt;Getters/Setters. Evil. Period&lt;/a&gt;. In a nutshell, they encourage programmers to think about objects as of data structures, and this type of thinking is pure procedural (like in COBOL or C). In an object-oriented language there are no data structures, but only objects that expose behavior (not attributes/properties!)&lt;/p&gt;\n\n&lt;p&gt;You may find more about them in Section 3.5 of &lt;a href=&quot;https://www.yegor256.com/elegant-objects.html&quot; rel=&quot;noreferrer&quot;&gt;Elegant Objects&lt;/a&gt; (my book about object-oriented programming).&lt;/p&gt;\n    ","\n&lt;p&gt;There are many reasons. My favorite one is when you need to change the behavior or regulate what you can set on a variable. For instance, lets say you had a setSpeed(int speed) method. But you want that you can only set a maximum speed of 100. You would do something like:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setSpeed&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; speed)&lt;/span&gt; {\n  &lt;span class=&quot;hljs-keyword&quot;&gt;if&lt;/span&gt; ( speed &amp;gt; &lt;span class=&quot;hljs-number&quot;&gt;100&lt;/span&gt; ) {\n    &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.speed = &lt;span class=&quot;hljs-number&quot;&gt;100&lt;/span&gt;;\n  } &lt;span class=&quot;hljs-keyword&quot;&gt;else&lt;/span&gt; {\n    &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.speed = speed;\n  }\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Now what if EVERYWHERE in your code you were using the public field and then you realized you need the above requirement? Have fun hunting down every usage of the public field instead of just modifying your setter.&lt;/p&gt;\n\n&lt;p&gt;My 2 cents :)&lt;/p&gt;\n    ","\n&lt;p&gt;One advantage of accessors and mutators is that you can perform validation.&lt;/p&gt;\n\n&lt;p&gt;For example, if &lt;code&gt;foo&lt;/code&gt; was public, I could easily set it to &lt;code&gt;null&lt;/code&gt; and then someone else could try to call a method on the object. But it&apos;s not there anymore! With a &lt;code&gt;setFoo&lt;/code&gt; method, I could ensure that &lt;code&gt;foo&lt;/code&gt; was never set to &lt;code&gt;null&lt;/code&gt;.&lt;/p&gt;\n\n&lt;p&gt;Accessors and mutators also allow for encapsulation - if you aren&apos;t supposed to see the value once its set (perhaps it&apos;s set in the constructor and then used by methods, but never supposed to be changed), it will never been seen by anyone. But if you can allow other classes to see or change it, you can provide the proper accessor and/or mutator.&lt;/p&gt;\n    ","\n&lt;p&gt;Depends on your language.  You&apos;ve tagged this &quot;object-oriented&quot; rather than &quot;Java&quot;, so I&apos;d like to point out that ChssPly76&apos;s answer is language-dependent.  In Python, for instance, there is no reason to use getters and setters.  If you need to change the behavior, you can use a property, which wraps a getter and setter around basic attribute access.  Something like this:&lt;/p&gt;\n&lt;pre class=&quot;lang-py s-code-block&quot;&gt;&lt;code class=&quot;hljs language-python&quot;&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Simple&lt;/span&gt;(&lt;span class=&quot;hljs-title class_ inherited__&quot;&gt;object&lt;/span&gt;):\n   &lt;span class=&quot;hljs-keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;_get_value&lt;/span&gt;(&lt;span class=&quot;hljs-params&quot;&gt;self&lt;/span&gt;):\n       &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; self._value -&lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;\n\n   &lt;span class=&quot;hljs-keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;_set_value&lt;/span&gt;(&lt;span class=&quot;hljs-params&quot;&gt;self, new_value&lt;/span&gt;):\n       self._value = new_value + &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;\n\n   &lt;span class=&quot;hljs-keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;_del_value&lt;/span&gt;(&lt;span class=&quot;hljs-params&quot;&gt;self&lt;/span&gt;):\n       self.old_values.append(self._value)\n       &lt;span class=&quot;hljs-keyword&quot;&gt;del&lt;/span&gt; self._value\n\n   value = &lt;span class=&quot;hljs-built_in&quot;&gt;property&lt;/span&gt;(_get_value, _set_value, _del_value)\n&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;Thanks, that really clarified my thinking. Now here is (almost) 10 (almost) good reasons NOT to use getters and setters:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;When you realize you need to do more than just set and get the value, you can just make the field private, which will instantly tell you where you&apos;ve directly accessed it.&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;Any validation you perform in there can only be context free, which validation rarely is in practice.&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;You can change the value being set - this is an absolute nightmare when the caller passes you a value that they [shock horror] want you to store AS IS.&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;You can hide the internal representation - fantastic, so you&apos;re making sure that all these operations are symmetrical right?&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;You&apos;ve insulated your public interface from changes under the sheets - if you were designing an interface and weren&apos;t sure whether direct access to something was OK, then you should have kept designing.&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;Some libraries expect this, but not many - reflection, serialization, mock objects all work just fine with public fields.&lt;br&gt;&lt;/li&gt;\n&lt;li&gt;Inheriting this class, you can override default functionality - in other words you can REALLY confuse callers by not only hiding the implementation but making it inconsistent.&lt;br&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;The last three I&apos;m just leaving (N/A or D/C)...&lt;/p&gt;\n    ","\n&lt;p&gt;Well i just want to add that even if sometimes they are necessary for the encapsulation and security of your variables/objects, if we want to code a real Object Oriented Program, then we need to &lt;strong&gt;&lt;a href=&quot;http://www.javaworld.com/javaworld/jw-09-2003/jw-0905-toolbox.html?page=1&quot;&gt;STOP OVERUSING THE ACCESSORS&lt;/a&gt;&lt;/strong&gt;, cause sometimes we depend a lot on them when is not really necessary and that makes almost the same as if we put the variables public.&lt;/p&gt;\n    ","\n&lt;p&gt;EDIT: I answered this question because there are a bunch of people learning programming asking this, and most of the answers are very technically competent, but they&apos;re not as easy to understand if you&apos;re a newbie. We were all newbies, so I thought I&apos;d try my hand at a more newbie friendly answer.&lt;/p&gt;\n\n&lt;p&gt;The two main ones are polymorphism, and validation. Even if it&apos;s just a stupid data structure.&lt;/p&gt;\n\n&lt;p&gt;Let&apos;s say we have this simple class:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Bottle&lt;/span&gt; {\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; amountOfWaterMl;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; capacityMl;\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;A very simple class that holds how much liquid is in it, and what its capacity is (in milliliters).&lt;/p&gt;\n\n&lt;p&gt;What happens when I do:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;Bottle&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;bot&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;new&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Bottle&lt;/span&gt;();\nbot.amountOfWaterMl = &lt;span class=&quot;hljs-number&quot;&gt;1500&lt;/span&gt;;\nbot.capacityMl = &lt;span class=&quot;hljs-number&quot;&gt;1000&lt;/span&gt;;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Well, you wouldn&apos;t expect that to work, right?\nYou want there to be some kind of sanity check. And worse, what if I never specified the maximum capacity? Oh dear, we have a problem.&lt;/p&gt;\n\n&lt;p&gt;But there&apos;s another problem too. What if bottles were just one type of container? What if we had several containers, all with capacities and amounts of liquid filled? If we could just make an interface, we could let the rest of our program accept that interface, and bottles, jerrycans and all sorts of stuff would just work interchangably. Wouldn&apos;t that be better? Since interfaces demand methods, this is also a good thing.&lt;/p&gt;\n\n&lt;p&gt;We&apos;d end up with something like:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;interface&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;LiquidContainer&lt;/span&gt; {\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getAmountMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setAmountMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; amountMl)&lt;/span&gt;;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getCapacityMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;;\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Great! And now we just change Bottle to this:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Bottle&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;extends&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;LiquidContainer&lt;/span&gt; {\n  &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; capacityMl;\n  &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; amountFilledMl;\n\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;Bottle&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; capacityMl, &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; amountFilledMl)&lt;/span&gt; {\n    &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.capacityMl = capacityMl;\n    &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.amountFilledMl = amountFilledMl;\n    checkNotOverFlow();\n  }\n\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getAmountMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; amountFilledMl;\n  }\n\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setAmountMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; amountMl)&lt;/span&gt; {\n     &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.amountFilled = amountMl;\n     checkNotOverFlow();\n  }\n  &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getCapacityMl&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n    &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; capacityMl;\n  }\n\n  &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;checkNotOverFlow&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n    &lt;span class=&quot;hljs-keyword&quot;&gt;if&lt;/span&gt;(amountOfWaterMl &amp;gt; capacityMl) {\n      &lt;span class=&quot;hljs-keyword&quot;&gt;throw&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;new&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;BottleOverflowException&lt;/span&gt;();\n    }\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;I&apos;ll leave the definition of the BottleOverflowException as an exercise to the reader.&lt;/p&gt;\n\n&lt;p&gt;Now notice how much more robust this is. We can deal with any type of container in our code now by accepting LiquidContainer instead of Bottle. And how these bottles deal with this sort of stuff can all differ. You can have bottles that write their state to disk when it changes, or bottles that save on SQL databases or GNU knows what else.&lt;/p&gt;\n\n&lt;p&gt;And all these can have different ways to handle various whoopsies. The Bottle just checks and if it&apos;s overflowing it throws a RuntimeException. But that might be the wrong thing to do. \n(There is a useful discussion to be had about error handling, but I&apos;m keeping it very simple here on purpose. People in comments will likely point out the flaws of this simplistic approach. ;) )&lt;/p&gt;\n\n&lt;p&gt;And yes, it seems like we go from a very simple idea to getting much better answers quickly.&lt;/p&gt;\n\n&lt;p&gt;Please note also that you can&apos;t change the capacity of a bottle. It&apos;s now set in stone. You could do this with an int by declaring it final. But if this was a list, you could empty it, add new things to it, and so on. You can&apos;t limit the access to touching the innards.&lt;/p&gt;\n\n&lt;p&gt;There&apos;s also the third thing that not everyone has addressed: getters and setters use method calls. That means that they look like normal methods everywhere else does. Instead of having weird specific syntax for DTOs and stuff, you have the same thing everywhere.&lt;/p&gt;\n    ","\n&lt;p&gt;I know it&apos;s a bit late, but I think there are some people who are interested in performance.&lt;/p&gt;\n\n&lt;p&gt;I&apos;ve done a little performance test. I wrote a class &quot;NumberHolder&quot; which, well, holds an Integer. You can either read that Integer by using the getter method\n&lt;code&gt;anInstance.getNumber()&lt;/code&gt; or by directly accessing the number by using &lt;code&gt;anInstance.number&lt;/code&gt;. My programm reads the number 1,000,000,000 times, via both ways. That process is repeated five times and the time is printed. I&apos;ve got the following result:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;Time &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 953ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 741ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 655ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 743ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 656ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 634ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 637ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 629ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 633ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 625ms\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;(Time 1 is the direct way, Time 2 is the getter)&lt;/p&gt;\n\n&lt;p&gt;You see, the getter is (almost) always a bit faster. Then I tried with different numbers of cycles. Instead of 1 million, I used 10 million and 0.1 million.\nThe results:&lt;/p&gt;\n\n&lt;p&gt;10 million cycles: &lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;Time &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 6382ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 6351ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 6363ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 6351ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 6350ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 6363ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 6353ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 6357ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 6348ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 6354ms\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;With 10 million cycles, the times are almost the same.\nHere are 100 thousand (0.1 million) cycles:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;Time &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 77ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 73ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 94ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 65ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 67ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 63ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 65ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 65ms\nTime &lt;span class=&quot;hljs-number&quot;&gt;1&lt;/span&gt;: 66ms, Time &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;: 63ms\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Also with different amounts of cycles, the getter is a little bit faster than the regular way. I hope this helped you.&lt;/p&gt;\n    ","\n&lt;h2&gt;We use getters and setters:&lt;/h2&gt;\n\n&lt;ul&gt;\n&lt;li&gt;for reusability&lt;/li&gt;\n&lt;li&gt;to perform validation in later stages of programming&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Getter and setter methods are public interfaces to access private class members.&lt;/p&gt;\n\n&lt;hr&gt;\n\n&lt;h2&gt;Encapsulation mantra&lt;/h2&gt;\n\n&lt;p&gt;The encapsulation mantra is to make fields private and methods public.&lt;/p&gt;\n\n&lt;blockquote&gt;\n  &lt;p&gt;&lt;strong&gt;Getter Methods:&lt;/strong&gt; &lt;em&gt;We can get access to private variables.&lt;/em&gt;&lt;/p&gt;\n  \n  &lt;p&gt;&lt;strong&gt;Setter Methods:&lt;/strong&gt; &lt;em&gt;We can modify private fields.&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Even though the getter and setter methods do not add new functionality, we can change our mind come back later to make that method&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;better;&lt;/li&gt;\n&lt;li&gt;safer; and&lt;/li&gt;\n&lt;li&gt;faster.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr&gt;\n\n&lt;p&gt;Anywhere a value can be used, a method that returns that value can be added. Instead of:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;x&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;1000&lt;/span&gt; - &lt;span class=&quot;hljs-number&quot;&gt;500&lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;use&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;x&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;1000&lt;/span&gt; - class_name.getValue();\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;hr&gt;\n\n&lt;h2&gt;In layman&apos;s terms&lt;/h2&gt;\n\n&lt;p&gt;&lt;img src=&quot;https://i.stack.imgur.com/2lgj0.png&quot; alt=&quot;Representation of &amp;quot;Person&amp;quot; class&quot;&gt;&lt;/p&gt;\n\n&lt;p&gt;Suppose we need to store the details of this &lt;code&gt;Person&lt;/code&gt;. This &lt;code&gt;Person&lt;/code&gt; has the fields &lt;code&gt;name&lt;/code&gt;, &lt;code&gt;age&lt;/code&gt; and &lt;code&gt;sex&lt;/code&gt;. Doing this involves creating methods for &lt;code&gt;name&lt;/code&gt;, &lt;code&gt;age&lt;/code&gt; and &lt;code&gt;sex&lt;/code&gt;. Now if we need create another person, it becomes necessary to create the methods for &lt;code&gt;name&lt;/code&gt;, &lt;code&gt;age&lt;/code&gt;, &lt;code&gt;sex&lt;/code&gt; all over again.&lt;/p&gt;\n\n&lt;p&gt;Instead of doing this, we can create a bean &lt;code&gt;class(Person)&lt;/code&gt; with getter and setter methods.  So tomorrow we can just create objects of this Bean &lt;code&gt;class(Person class)&lt;/code&gt; whenever we need to add a new person (see the figure). Thus we are reusing the fields and methods of bean class, which is much better.&lt;/p&gt;\n    ","\n&lt;p&gt;I spent quite a while thinking this over for the Java case, and I believe the real reasons are:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Code to the interface, not the implementation&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Interfaces only specify methods, not fields&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;In other words, the only way you can specify a field in an interface is by providing a method for writing a new value and a method for reading the current value.  &lt;/p&gt;\n\n&lt;p&gt;Those methods are the infamous getter and setter....&lt;/p&gt;\n    ","\n&lt;p&gt;Don&apos;t use getters setters unless needed for your current delivery I.e. Don&apos;t think too much about what would happen in the future, if any thing to be changed its a change request in most of the production applications, systems.&lt;/p&gt;\n\n&lt;p&gt;Think simple, easy, add complexity when needed.&lt;/p&gt;\n\n&lt;p&gt;I would not take advantage of ignorance of business owners of deep technical know how just because I think it&apos;s correct or I like the approach.&lt;/p&gt;\n\n&lt;p&gt;I have massive system written without getters setters only with access modifiers and some methods to validate n perform biz logic. If you absolutely needed the. Use anything.&lt;/p&gt;\n    ","\n&lt;p&gt;It can be useful for lazy-loading.  Say the object in question is stored in a database, and you don&apos;t want to go get it unless you need it.  If the object is retrieved by a getter, then the internal object can be null until somebody asks for it, then you can go get it on the first call to the getter.&lt;/p&gt;\n\n&lt;p&gt;I had a base page class in a project that was handed to me that was loading some data from a couple different web service calls, but the data in those web service calls wasn&apos;t always used in all child pages.  Web services, for all of the benefits, pioneer new definitions of &quot;slow&quot;, so you don&apos;t want to make a web service call if you don&apos;t have to.&lt;/p&gt;\n\n&lt;p&gt;I moved from public fields to getters, and now the getters check the cache, and if it&apos;s not there call the web service.  So with a little wrapping, a lot of web service calls were prevented.&lt;/p&gt;\n\n&lt;p&gt;So the getter saves me from trying to figure out, on each child page, what I will need.  If I need it, I call the getter, and it goes to find it for me if I don&apos;t already have it.&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;    &lt;span class=&quot;hljs-keyword&quot;&gt;protected&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;YourType&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;_yourName&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-literal&quot;&gt;null&lt;/span&gt;;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; YourType YourName{\n      get\n      {\n        &lt;span class=&quot;hljs-keyword&quot;&gt;if&lt;/span&gt; (_yourName == &lt;span class=&quot;hljs-literal&quot;&gt;null&lt;/span&gt;)\n        {\n          _yourName = &lt;span class=&quot;hljs-keyword&quot;&gt;new&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;YourType&lt;/span&gt;();\n          &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; _yourName;\n        }\n      }\n    }\n&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;One aspect I missed in the answers so far, the access specification:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;for members you have only one access specification for both setting and getting&lt;/li&gt;\n&lt;li&gt;for setters and getters you can fine tune it and define it separately&lt;/li&gt;\n&lt;/ul&gt;\n    ","\n&lt;p&gt;In languages which don&apos;t support &quot;properties&quot; (C++, Java) or require recompilation of clients when changing fields to properties (C#), using get/set methods is easier to modify. For example, adding validation logic to a setFoo method will not require changing the public interface of a class.&lt;/p&gt;\n\n&lt;p&gt;In languages which support &quot;real&quot; properties (Python, Ruby, maybe Smalltalk?) there is no point to get/set methods.&lt;/p&gt;\n    ","\n&lt;p&gt;One of the basic principals of OO design: &lt;strong&gt;Encapsulation!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;It gives you many benefits, one of which being that you can change the implementation of the getter/setter behind the scenes but any consumer of that value will continue to work as long as the data type remains the same.&lt;/p&gt;\n    ","\n&lt;p&gt;You should use getters and setters when:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;You&apos;re dealing with something that is conceptually an attribute, but:\n&lt;ul&gt;\n&lt;li&gt;Your language doesn&apos;t have properties (or some similar mechanism, like Tcl&apos;s variable traces), or&lt;/li&gt;\n&lt;li&gt;Your language&apos;s property support isn&apos;t sufficient for this use case, or&lt;/li&gt;\n&lt;li&gt;Your language&apos;s (or sometimes your framework&apos;s) idiomatic conventions encourage getters or setters for this use case.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;So this is very rarely a general OO question; it&apos;s a language-specific question, with different answers for different languages (and different use cases).&lt;/p&gt;\n\n&lt;hr&gt;\n\n&lt;p&gt;From an OO theory point of view, getters and setters are useless. The interface of your class is what it does, not what its state is. (If not, you&apos;ve written the wrong class.) In very simple cases, where what a class does is just, e.g., represent a point in rectangular coordinates,* the attributes are part of the interface; getters and setters just cloud that. But in anything but very simple cases, neither the attributes nor getters and setters are part of the interface.&lt;/p&gt;\n\n&lt;p&gt;Put another way: If you believe that consumers of your class shouldn&apos;t even know that you have a &lt;code&gt;spam&lt;/code&gt; attribute, much less be able to change it willy-nilly, then giving them a &lt;code&gt;set_spam&lt;/code&gt; method is the last thing you want to do.&lt;/p&gt;\n\n&lt;p&gt;&lt;sub&gt;* Even for that simple class, you may not necessarily want to allow setting the &lt;code&gt;x&lt;/code&gt; and &lt;code&gt;y&lt;/code&gt; values. If this is really a class, shouldn&apos;t it have methods like &lt;code&gt;translate&lt;/code&gt;, &lt;code&gt;rotate&lt;/code&gt;, etc.? If it&apos;s only a class because your language doesn&apos;t have records/structs/named tuples, then this isn&apos;t really a question of OO&lt;/sub&gt;&lt;/p&gt;\n\n&lt;hr&gt;\n\n&lt;p&gt;But nobody is ever doing general OO design. They&apos;re doing design, and implementation, in a specific language. And in some languages, getters and setters are far from useless.&lt;/p&gt;\n\n&lt;p&gt;If your language doesn&apos;t have properties, then the only way to represent something that&apos;s conceptually an attribute, but is actually computed, or validated, etc., is through getters and setters.&lt;/p&gt;\n\n&lt;p&gt;Even if your language does have properties, there may be cases where they&apos;re insufficient or inappropriate. For example, if you want to allow subclasses to control the semantics of an attribute, in languages without dynamic access, a subclass can&apos;t substitute a computed property for an attribute.&lt;/p&gt;\n\n&lt;p&gt;As for the &quot;what if I want to change my implementation later?&quot; question (which is repeated multiple times in different wording in both the OP&apos;s question and the accepted answer): If it really is a pure implementation change, and you started with an attribute, you can change it to a property without affecting the interface. Unless, of course, your language doesn&apos;t support that. So this is really just the same case again.&lt;/p&gt;\n\n&lt;p&gt;Also, it&apos;s important to follow the idioms of the language (or framework) you&apos;re using. If you write beautiful Ruby-style code in C#, any experienced C# developer other than you is going to have trouble reading it, and that&apos;s bad. Some languages have stronger cultures around their conventions than others.and it may not be a coincidence that Java and Python, which are on opposite ends of the spectrum for how idiomatic getters are, happen to have two of the strongest cultures.&lt;/p&gt;\n\n&lt;p&gt;Beyond human readers, there will be libraries and tools that expect you to follow the conventions, and make your life harder if you don&apos;t. Hooking Interface Builder widgets to anything but ObjC properties, or using certain Java mocking libraries without getters, is just making your life more difficult. If the tools are important to you, don&apos;t fight them.&lt;/p&gt;\n    ","\n&lt;p&gt;From a object orientation design standpoint both alternatives can be damaging to the maintenance of the code by weakening the encapsulation of the classes. For a discussion you can look into this excellent article: &lt;a href=&quot;http://typicalprogrammer.com/?p=23&quot; rel=&quot;noreferrer&quot;&gt;http://typicalprogrammer.com/?p=23&lt;/a&gt; &lt;/p&gt;\n    ","\n&lt;p&gt;Code &lt;em&gt;evolves&lt;/em&gt;.  &lt;code&gt;private&lt;/code&gt; is great for when &lt;em&gt;you need data member protection&lt;/em&gt;.  Eventually all classes should be sort of &quot;miniprograms&quot; that have a well-defined interface &lt;em&gt;that you can&apos;t just screw with the internals of&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;That said, &lt;em&gt;software development&lt;/em&gt; isn&apos;t about setting down that final version of the class as if you&apos;re pressing some cast iron statue on the first try.  While you&apos;re working with it, code is more like clay.  &lt;strong&gt;It evolves&lt;/strong&gt; as you develop it and learn more about the problem domain you are solving.  During development classes may interact with each other than they should (dependency you plan to factor out), merge together, or split apart.  So I think the debate boils down to people not wanting to religiously write&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getVar&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; const { &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;var&lt;/span&gt; ; }\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;So you have:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;doSomething( obj-&amp;gt;getVar() ) ;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Instead of&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;doSomething( obj-&amp;gt;&lt;span class=&quot;hljs-keyword&quot;&gt;var&lt;/span&gt; ) ;\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Not only is &lt;code&gt;getVar()&lt;/code&gt; visually noisy, it gives this illusion that &lt;code&gt;gettingVar()&lt;/code&gt; is somehow a more complex process than it really is.  How you (as the class writer) regard the sanctity of &lt;code&gt;var&lt;/code&gt; is particularly confusing to a user of your class if it has a passthru setter -- then it looks like you&apos;re putting up these gates to &quot;protect&quot; something you insist is valuable, (the sanctity of &lt;code&gt;var&lt;/code&gt;) but yet even you concede &lt;code&gt;var&lt;/code&gt;&apos;s protection isn&apos;t worth much by the ability for anyone to just come in and &lt;code&gt;set&lt;/code&gt; &lt;code&gt;var&lt;/code&gt; to whatever value they want, without you even peeking at what they are doing.&lt;/p&gt;\n\n&lt;p&gt;So I program as follows (assuming an &quot;agile&quot; type approach -- ie when I write code not knowing &lt;em&gt;exactly&lt;/em&gt; what it will be doing/don&apos;t have time or experience to plan an elaborate waterfall style interface set):&lt;/p&gt;\n\n&lt;p&gt;1) Start with all public members for basic objects with data and behavior.  This is why in all my C++ &quot;example&quot; code you&apos;ll notice me using &lt;code&gt;struct&lt;/code&gt; instead of &lt;code&gt;class&lt;/code&gt; everywhere.&lt;/p&gt;\n\n&lt;p&gt;2) When an object&apos;s internal behavior for a data member becomes complex enough, (for example, it likes to keep an internal &lt;code&gt;std::list&lt;/code&gt; in some kind of order), accessor type functions are written.  Because I&apos;m programming by myself, I don&apos;t always set the member &lt;code&gt;private&lt;/code&gt; right away, but somewhere down the evolution of the class the member will be &quot;promoted&quot; to either &lt;code&gt;protected&lt;/code&gt; or &lt;code&gt;private&lt;/code&gt;.&lt;/p&gt;\n\n&lt;p&gt;3) Classes that are fully fleshed out and have strict rules about their internals (ie &lt;em&gt;they&lt;/em&gt; know exactly what they are doing, and you are not to &quot;fuck&quot; (technical term) with its internals) are given the &lt;code&gt;class&lt;/code&gt; designation, default private members, and only a select few members are allowed to be &lt;code&gt;public&lt;/code&gt;.&lt;/p&gt;\n\n&lt;p&gt;I find this approach allows me to avoid sitting there and religiously writing getter/setters when a lot of data members get migrated out, shifted around, etc. during the early stages of a class&apos;s evolution.&lt;/p&gt;\n    ","\n&lt;p&gt;There is a good reason to consider using accessors is there is no property inheritance. See next example:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;TestPropertyOverride&lt;/span&gt; {\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;static&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;A&lt;/span&gt; {\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;i&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;;\n\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;add&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n            i++;\n        }\n\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getI&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n            &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; i;\n        }\n    }\n\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;static&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;B&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;extends&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;A&lt;/span&gt; {\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;i&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;;\n\n        &lt;span class=&quot;hljs-meta&quot;&gt;@Override&lt;/span&gt;\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;add&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n            i = i + &lt;span class=&quot;hljs-number&quot;&gt;2&lt;/span&gt;;\n        }\n\n        &lt;span class=&quot;hljs-meta&quot;&gt;@Override&lt;/span&gt;\n        &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;int&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;getI&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n            &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; i;\n        }\n    }\n\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;static&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;main&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(String[] args)&lt;/span&gt; {\n        &lt;span class=&quot;hljs-type&quot;&gt;A&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;a&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;new&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;B&lt;/span&gt;();\n        System.out.println(a.i);\n        a.add();\n        System.out.println(a.i);\n        System.out.println(a.getI());\n    }\n}\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Output:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;\n&lt;span class=&quot;hljs-number&quot;&gt;0&lt;/span&gt;\n&lt;span class=&quot;hljs-number&quot;&gt;4&lt;/span&gt;\n&lt;/code&gt;&lt;/pre&gt;\n    ","\n&lt;p&gt;&lt;strong&gt;Getters&lt;/strong&gt; and &lt;strong&gt;setters&lt;/strong&gt; are used to implement two of the fundamental aspects of Object Oriented Programming which are: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Abstraction&lt;/li&gt;\n&lt;li&gt;Encapsulation&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Suppose we have an Employee class:&lt;/p&gt;\n\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;package&lt;/span&gt; com.highmark.productConfig.types;\n\n&lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;hljs-title class_&quot;&gt;Employee&lt;/span&gt; {\n\n    &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; String firstName;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; String middleName;\n    &lt;span class=&quot;hljs-keyword&quot;&gt;private&lt;/span&gt; String lastName;\n\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; String &lt;span class=&quot;hljs-title function_&quot;&gt;getFirstName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n      &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; firstName;\n    }\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setFirstName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(String firstName)&lt;/span&gt; {\n       &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.firstName = firstName;\n    }\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; String &lt;span class=&quot;hljs-title function_&quot;&gt;getMiddleName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n        &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; middleName;\n    }\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setMiddleName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(String middleName)&lt;/span&gt; {\n         &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.middleName = middleName;\n    }\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; String &lt;span class=&quot;hljs-title function_&quot;&gt;getLastName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt; {\n        &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; lastName;\n    }\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; &lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setLastName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(String lastName)&lt;/span&gt; {\n        &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.lastName = lastName;\n    }\n\n    &lt;span class=&quot;hljs-keyword&quot;&gt;public&lt;/span&gt; String &lt;span class=&quot;hljs-title function_&quot;&gt;getFullName&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;()&lt;/span&gt;{\n        &lt;span class=&quot;hljs-keyword&quot;&gt;return&lt;/span&gt; &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.getFirstName() + &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.getMiddleName() +  &lt;span class=&quot;hljs-built_in&quot;&gt;this&lt;/span&gt;.getLastName();\n    }\n }\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;Here the implementation details of Full Name is hidden from the user and is not accessible directly to the user, unlike a public attribute.   &lt;/p&gt;\n    ","\n&lt;p&gt;If you don&apos;t require any validations and not even need to maintain state i.e. one property depends on another so we need to maintain the state when one is change. You can keep it simple by making field public and not using getter and setters.&lt;/p&gt;\n&lt;p&gt;I think OOPs complicates things as the program grows it becomes nightmare for developer to scale.&lt;/p&gt;\n&lt;p&gt;A simple example; we generate c++ headers from xml. The header contains simple field which does not require any validations. But still as in OOPS accessor  are fashion we generates them  as following.&lt;/p&gt;\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;const Filed&amp;amp; getfield() const\nField&amp;amp; getField() \n&lt;span class=&quot;hljs-keyword&quot;&gt;void&lt;/span&gt; &lt;span class=&quot;hljs-title function_&quot;&gt;setfield&lt;/span&gt;&lt;span class=&quot;hljs-params&quot;&gt;(const Field&amp;amp; field)&lt;/span&gt;{...} \n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;which is very verbose and is not required. a simple&lt;/p&gt;\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;struct \n{\n   Field field;\n};\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;is enough and readable.\nFunctional programming don&apos;t have the concept of data hiding they even don&apos;t require it as they do not mutate the data.&lt;/p&gt;\n    ","\n&lt;p&gt;Getter and setter methods are accessor methods, meaning that they are generally a public interface to change private class members. You use getter and setter methods to define a property. You access getter and setter methods as properties outside the class, even though you define them within the class as methods. Those properties outside the class can have a different name from the property name in the class.&lt;/p&gt;\n\n&lt;p&gt;There are some advantages to using getter and setter methods, such as the ability to let you create members with sophisticated functionality that you can access like properties. They also let you create read-only and write-only properties.&lt;/p&gt;\n\n&lt;p&gt;Even though getter and setter methods are useful, you should be careful not to overuse them because, among other issues, they can make code maintenance more difficult in certain situations. Also, they provide access to your class implementation, like public members. OOP practice discourages direct access to properties within a class.&lt;/p&gt;\n\n&lt;p&gt;When you write classes, you are always encouraged to make as many as possible of your instance variables private and add getter and setter methods accordingly. This is because there are several times when you may not want to let users change certain variables within your classes. For example, if you have a private static method that tracks the number of instances created for a specific class, you don&apos;t want a user to modify that counter using code. Only the constructor statement should increment that variable whenever it&apos;s called. In this situation, you might create a private instance variable and allow a getter method only for the counter variable, which means users are able to retrieve the current value only by using the getter method, and they won&apos;t be able to set new values using the setter method. Creating a getter without a setter is a simple way of making certain variables in your class read-only.&lt;/p&gt;\n    ","\n&lt;p&gt;There is a difference between DataStructure and Object.&lt;/p&gt;\n&lt;p&gt;Datastructure should expose its innards and not behavior.&lt;/p&gt;\n&lt;p&gt;An Object should not expose its innards but it should expose its behavior, which is also known as the Law of Demeter&lt;/p&gt;\n&lt;p&gt;Mostly DTOs are considered more of a datastructure and not Object. They should only expose their data and not behavior. Having Setter/Getter in DataStructure will expose behavior instead of data inside it. This further increases the chance of violation of &lt;strong&gt;Law of Demeter&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Uncle Bob in his book Clean code explained the Law of Demeter.&lt;/p&gt;\n&lt;blockquote&gt;\n&lt;p&gt;There is a well-known heuristic called the Law of Demeter that says a\nmodule should not know about the innards of the objects it\nmanipulates. As we saw in the last section, objects hide their data\nand expose operations. This means that an object should not expose its\ninternal structure through accessors because to do so is to expose,\nrather than to hide, its internal structure.&lt;/p&gt;\n&lt;p&gt;More precisely, the Law of Demeter says that a method f of a class C\nshould only call the methods of these:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;C&lt;/li&gt;\n&lt;li&gt;An object created by f&lt;/li&gt;\n&lt;li&gt;An object passed as an argument to f&lt;/li&gt;\n&lt;li&gt;An object held in an instance variable of C&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The method should not invoke methods on objects that are returned by any of the allowed functions.\nIn other words, talk to friends, not to strangers.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;p&gt;So according this, example of LoD violation is:&lt;/p&gt;\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;final&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;String&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;outputDir&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; ctxt.getOptions().getScratchDir().getAbsolutePath();\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;Here, the function should call the method of its immediate friend which is ctxt here, It should not call the method of its immediate friend&apos;s friend. but this rule doesn&apos;t apply to data structure. so here if ctxt, option, scratchDir are  datastructure then why to wrap their internal data with some behavior and doing a violation of LoD.&lt;/p&gt;\n&lt;p&gt;Instead, we can do something like this.&lt;/p&gt;\n&lt;pre class=&quot;lang-java s-code-block&quot;&gt;&lt;code class=&quot;hljs language-java&quot;&gt;&lt;span class=&quot;hljs-keyword&quot;&gt;final&lt;/span&gt; &lt;span class=&quot;hljs-type&quot;&gt;String&lt;/span&gt; &lt;span class=&quot;hljs-variable&quot;&gt;outputDir&lt;/span&gt; &lt;span class=&quot;hljs-operator&quot;&gt;=&lt;/span&gt; ctxt.options.scratchDir.absolutePath;\n&lt;/code&gt;&lt;/pre&gt;\n&lt;p&gt;This fulfills our needs and doesn&apos;t even violate LoD.&lt;/p&gt;\n&lt;p&gt;Inspired by Clean Code by Robert C. Martin(Uncle Bob)&lt;/p&gt;\n    ","\n&lt;p&gt;Additionally, this is to &quot;future-proof&quot; your class. In particular, changing from a field to a property is an ABI break, so if you do later decide that you need more logic than just &quot;set/get the field&quot;, then you need to break ABI, which of course creates problems for anything else already compiled against your class.&lt;/p&gt;\n    ","\n&lt;p&gt;One other use (in languages that support properties) is that setters and getters can imply that an operation is non-trivial.  Typically, you want to avoid doing anything that&apos;s computationally expensive in a property.&lt;/p&gt;\n    ","\n&lt;p&gt;One relatively modern advantage of getters/setters is that is makes it easier to browse code in tagged (indexed) code editors. E.g. If you want to see who sets a member, you can open the call hierarchy of the setter.&lt;/p&gt;\n\n&lt;p&gt;On the other hand, if the member is public, the tools don&apos;t make it possible to filter read/write access to the member. So you have to trudge though all uses of the member.&lt;/p&gt;\n    "]},"randomTags":[{"name":"asp.net-mvc-5","slug":"asp.net-mvc-5"},{"name":"sqliteopenhelper","slug":"sqliteopenhelper"},{"name":"standards","slug":"standards"},{"name":"quoting","slug":"quoting"},{"name":"sh","slug":"sh"},{"name":"greatest-n-per-group","slug":"greatest-n-per-group"},{"name":"namespaces","slug":"namespaces"},{"name":"symbols","slug":"symbols"},{"name":"soft-keyboard","slug":"soft-keyboard"},{"name":"underscore.js","slug":"underscore.js"},{"name":"guid","slug":"guid"},{"name":"sql-delete","slug":"sql-delete"},{"name":"fopen","slug":"fopen"},{"name":"jsf-2","slug":"jsf-2"},{"name":"aggregation","slug":"aggregation"},{"name":"html","slug":"html"},{"name":"prototype-oriented","slug":"prototype-oriented"},{"name":"maps","slug":"maps"},{"name":"angular-template","slug":"angular-template"},{"name":"postgresql","slug":"postgresql"}]},"__N_SSG":true}